{

    "Welcome to Portland: Why Ammon Bundy is in for a Treat": {
        "title": "Welcome to Portland: Why Ammon Bundy is in for a Treat",
        "date": "January 29, 2016",
        "description": [{
                "paragraph": "Does everyone know the song ‘I Fought the Law,’ with the famous lyrics, ‘I fought the law, and the law won?’  Good, it will help you get a better understand why Ammon Bundy and his terrorist militiamen friends will face a harsh reality now that they have been arrested for taking over the Malheur National Wildlife Refuge.  After three weeks holding the place hostage, threatening to shoot law enforcement should they try to take them out, and leaving the people of Harney county scared, Ammon Bundy and his goons were finally arrested after 8 of them left to to attend a town meeting in the town of John Day."
            }, {
                "paragraph": "The old adage of ‘follow the law’ held up when the FBI stopped them dead in their tracks.  Of course, most of these men, callously breaking the law by holding a federal building hostage, once they were caught, took the p***y way out and complied with the officers (the exact opposite response they threatened to take).  So much for being willing to die.  One member, the spokesmen of the group, LaVoy Finicum, held true to his word of rather being killed than going to jail, as he charged an officer and pulled out a gun before being shot and killed.  Ryan Bundy, the weird looking brother, got a minor wound for not initially complying.  Otherwise, it was a clean arrest.  The group and family members, might claim murder, but if you don’t listen to the police and try to shoot, you will get shot back.  Now that Ammon Bundy and his dumb friends are charged with a felony, sitting in the Multnomah County prison in Portland, some seven hours and seemingly half the world away, now that they have complied with the law, they are in for a rude awakening."
            }, {
                "paragraph": "For starters, being charged with a feline you leads to longer prison sentences than a simple misdemeanor.  That means they will spend at least a year in prison.  They could take a plea deal perhaps but as it is, they face up to ten years in prison.  It's clear the men are guilty.  They not only were seen at the Refuge, they frequently posted images, blogs, videos and other things on social media discussing their demands, plans, and ask for support and supplies (the fact that one person sent a bunch of sex toys is not only hilarious but fitting for a group of people at a place they don’t belong receive something they don’t want or need).  Fortunately for these ingrates, they will get to be in federal prisons, which are much nicer than state prisons."
            }, {
                "paragraph": "As they are considered flight-risks, none of these goons will be able to get out of prison until their sentences are finished (at the moment).  As out-of-state individuals with no ties to Oregon whatsoever, they are untrustworthy and likely to flee.  When fighting the government and the legal system, they have the right to do so as they see fit, just like they have the right to protect land as they see fit.  Of course, people like these moronic militiamen think the government should have no rights, but they do."
            }, {
                "paragraph": "Another obvious repercussion is that Ammon Bundy and friends, who waved their second amendment rights in everyone’s faces as if they were patriotic for using them to protect themselves, and threaten those who tried to take their false rights away as lawbreakers, will no longer have that right.  As convicted felons, Ammon Bundy and friends lose their privilege to own guns, as convicted felons don’t have that right.  That probably won't stop any of them from illegally owning a gun, as at least one of the members was already a convicted felon, but they’ll have a tougher, (albeit way too easy) of a time getting their precious guns.  Given their criminal ways and delusional thoughts, they aren't likely to obey the federal government telling them they can’t own guns.  After all, second amendment fanatics think everyone has the right, even though criminals don’t.  And believe me, these men are criminals.  Look at the affidavit against these scumbags, this was well planned out."
            }, {
                "paragraph": "If any of these men want to find employment, they would have a hard time getting a job, having to disclose their convictions.  Of course, as ranch owners, that won’t be an issue, but people are less likely to support them, as they know who they are.  Only anti-government fanatics would want to do business with them.  They’re being mocked and ridiculed online, so anyone following the story will recognize them and taunt them for thinking they’re Patriots.  They’re not.  They’re anti-government terrorists."
            }, {
                "paragraph": "Being in Portland is a lot different than being in Burns, Oregon.  Ammon Bundy and friends won't get any chance to visit, as he’ll spend all of his time behind bars.  If Ammon wants to visit after he’s released from prison, he should take a chance to visit Multnomah Falls and be amazed by its natural beauty.  One thing he would need to keep in mind is that it remains a beauty because the Government owns the land so no one will tarnish its beauty.  Another thing lost amongst these scoundrels.  There are some things worth protecting, and those who wish to tarnish its value for a buck need to learn the government has a right to protect its interest.  It’s a lesson Bundy’s dad, famed anti-government tax-cheat Cliven Bundy needs to face.  Had the government taken care of him and his law-breaking ways, this mess in Harney County might’ve been avoided.  But as of now, Ammon Bundy can enjoy his likeness mocking him on a donut.  Isn’t that the real American Dream?"
            }
            
        ],
        "image": [{
                "name": "/static/img/voodoo.JPG",
                "caption": "A vision of what Ammon Bundy's life will be like, on a donut!"
            }, {
                "name": "/static/img/bundy.jpg",
                "caption": "Ryan Bundy: One picture happy, one picture upset.  Can you tell which one is which?"
            }
        ]
    },

    "Super Bowl 50: Look at That Smile!": {
        "title": "Super Bowl 50: Look at That Smile!",
        "date": "January 25, 2016",
        "description": [{
                "paragraph": "Super Bowl 50 is on its way, featuring a match-up of the NFL’s top two defenses, the Denver Broncos and Carolina Panthers (1 and 2 respectively).  The biggest headline will likely be the probable MVP this year, Carolina QB Cam Newton, a very talented but cocky player.  There are quite a few people that find Cam Newton obnoxious and arrogant, whether it’s his me-first attitude or his ‘Dab’ dancing whenever he scores a touchdown.  But on the other hand, how can you hate someone with a smile like his?"
            }, {
                "paragraph": "Offensively, Carolina features a wide variety of weapons, most notably, of course, Cam Newton, who not only has a great arm but also runs the ball quite well.  Plus at his size, he’s hard to bring down.  It’s the main reason Cam Newton is likely to be named MVP.  Jonathan Stewart is also a threat at the running back position, finally blossoming after Carolina ditched the two-back system with equally talented but different DeAngelo Williams.  Carolina has quite a few receivers capable of getting yardage, but Newton’s favorite target is his tight end Greg Olsen, one of the better tight ends in the league.  But at the end of the day, it’s all the man with the deceiving smile that is the team's most dangerous player."
            }, {
                "paragraph": "Denver’s offense on the other hand has been a big disappointment compared to years past, with Peyton Manning throwing numerous touchdowns and gaining multiple yards.  This year, Peyton Manning, in what may be his last season, has been inconsistent at best, injured for six games, and at the last game of the regular season, a backup for the first time since he was a freshman in college.  Peyton did replace Brock Osweiler in that game and provided a needed spark, allowing him to regain his starting spot back, but Denver’s offense isn’t quite what it’s used to be.  Their running game has been their most consistent part of their game, with Ron Hillman and C.J. Anderson splitting carries.  Their receivers, though talented, including Demaryius Thomas and Emmanuel Sanders, have not made the catches need to sustain long drives."
            }, {
                "paragraph": "The clear edge on offense belongs to Carolina, with Cam Newton, the likely MVP, able to hurt you in many ways, with his arm, legs and size.  But what about the team’s defense’s.  Who has the edge here."
            }, {
                "paragraph": "Denver enters the Super Bowl with the NFL’s top ranked defense.  I have never seen a defense defend Tom Brady and his high flying passing attack better than Denver did on Sunday.  They got all kinds of pressure on Brady and sacked him multiple times.  Led by Von Miller and DeMarcus Ware on the defensive line, and with Aqib Talib and Chris Harris Jr. in the Secondary, Denver hopes to prove that defense wins championships.  With that said, they haven’t faced a Quarterback with the dual-threat capabilities like Cam Newton.  They may get deceived by that smile."
            }, {
                "paragraph": "While Denver’s defense is ranked number 1, Carolina’s defense is ranked number 2.  Led by Luke Kuechly and Thomas Davis (who broke his hand in the NFC Championship game and is questionable for the Super Bowl), Carolina is equally ferocious and capable of slowing down a high powered offense.  They pressured Carson Palmer on Sunday and forced him to throw four interceptions (a sure sign of a bad day) and never looked back in that game."
            }, {
                "paragraph": "So who has the better defense?  Both Denver and Carolina have superb defense's, but Carolina gets a slight edge because they don’t have to face Cam Newton.  If anyone can slow him down, Denver’s the team, but questions remain.  Both teams have good special teams, with accurate kickers and good punters.  Carolina has the edge with Ted Ginn Jr as its punt/kick returner, one of the most dangerous in the NFL.  Both coaches are making their Super Bowl debut, neither one has an edge."
            }, {
                "paragraph": "Both teams have plenty of motivation.  Carolina, despite finishing 15-1 in the regular season, was often seen as a fluke more than a legit title contender.  They were even viewed as underdogs against the Seattle Seahawks in the divisional round.  What did Carolina do in that game?  Score 31 points in the first half while making Seattle look pathetic.  Seattle responded in the second half but still, it was over before the second half.  They’ve never won a Super Bowl in franchise history, and with their young players in it for the first time, their motivation is pretty high.  But don’t forget Denver.  They too were disrespected in the postseason.  Almost no one saw them beating the mighty Patriots, yet their top ranked defense flexed its muscles and slowed down Tom Brady and company.  Though they’ve played and won Super Bowl’s before, this could very well be Peyton Manning’s last game.  What better way for Peyton and the Broncos to finish the season (and his career) than being Champions?  It’s the best way to end a wonderful career.  Both teams have a lot to play for in Super Bowl 50.  Whoever executes the best will be the champion."
            }, {
                "paragraph": "So about that smile… There are plenty of reasons not to like Cam Newton.  Sure, he did stupid stuff in college.  Stole a laptop while he was at Florida and got kicked off the team.  He wound up at Auburn, won the Heisman and National Championship (sadly against my Oregon Ducks) with lots of controversy over his eligibility.  But every time I see that smile, it makes me feel happy.  I would kill for a smile like that.  So while Cam Newton acts arrogant at times, celebrates too much, and has the me-first attitude that many of the elite NBA players have, look at that smile."
            }, {
                "paragraph": "So who wins Super Bowl 50?  To me, it will come down to whether Denver has the ability to slow down Newton.  Denver has the top ranked defense, and defense wins Champions, but Newton is a far different beast than the other quarterbacks Denver has faced, particularly in the postseason.  Carolina’s defense should have no problem stopping Denver’s mediocre offense, but if Denver can force Newton to make turnovers, it will be a tight game.  Otherwise, I expect Carolina to win easily.  Final score: Carolina 31, Denver 14.  The one thing I can guarantee with Super Bowl 50: Coldplay performing at halftime is going to suck."
            }
            
        ],
        "image": [{
                "name": "/static/img/newton.jpg",
                "caption": "Look at the smile!"
            }, {
                "name": "/static/img/peyton.jpg",
                "caption": "Yet Peyton makes you laugh!"
            }
        ]
    },

    "White Privilege II - Why We Need a Conversation on Race": {
        "title": "White Privilege II - Why We Need a Conversation on Race",
        "date": "January 23, 2016",
        "description": [{
                "paragraph": "Yesterday, the hip-hop game was jolted by the new song from Macklemore & Ryan Lewis, 'White Privilege II,' a vicious track almost nine minutes long that discusses racism in the hip-hop world, in general, the Black Lives Matter movement, and how ‘White America’ is at an advantage as opposed to minorities.  Though this is not the first time Macklemore has discussed racism in his music; the original White Privilege was a song he released back in 2005, now that Macklemore is famous worldwide, the platform is expanded exponentially with his fame, social media and a generation of racism sensitivity.  Therefore, more people have a say than they did in 2005, when Macklemore was just a starving underground rapper from Seattle that until his unprecedented rise to fame, represented a city whose only taste of mainstream success was Sir Mix-a-Lot and his butt loving song Baby Got Back.  While Macklemore will never understand what it’s like to actually be a black person (something he is completely aware with), this track is important nonetheless as we will never get past racism without talking about it."
            }, {
                "paragraph": "Much of the initial attention is on the song’s second verse, where he raps 'You've exploited and stolen the music, the moment / The magic, the passion, the fashion, you toy with / The culture was never yours to make better / You're Miley, you're Elvis, you're Iggy Azalea / Fake and so plastic, you've heisted the magic / You've taken the drums and the accent you rapped in / You're branded 'hip-hop', it's so fascist and backwards / That Grandmaster Flash'd go slap it, you bastard.'  Not surprisingly, in a battle loving hip-hop culture, it’s Macklemore calling out musicians who have appropriated black culture in their music to advance their careers, calling them out for biting the culture but not having a clue about the African-American community itself.  Though Elvis is long deceased and Miley Cyrus doesn’t have much of an opinion, it was Iggy Azalea who took offense, completely missing the point of the song, instead focusing solely on herself.  Not surprising for an Australian white female pop-rapper who believes she can have street-cred acting black and be a pop rapper at the same time, which most people know can’t be done.    Of course, there’s more to this song than one rapper getting her feelings hurt, in a world where black people fear for their lives and feel discriminated against, this is the big picture.  The main point here is that some white artists act black to make themselves look cool but without the actual struggle the black community faces, it comes off as not authentic by any means."
            }, {
                "paragraph": "Earlier in the song, Macklemore raps 'Am I in the outside looking in, or am I in the inside looking out? / Is it my place to give my two cents / Or should I stand on the side and shut my mouth for justice? No peace / Okay, I'm saying that they're chanting out, ‘Black lives matter’, but I don't say it back / Is it okay for me to say? I don't know, so I watch and stand / In front of a line of police that look the same as me.'  Suggesting that it’s awkward for a white person to support movements like Black Lives Matter due to having the same skin color as the police.  Even though Macklemore understands to the extent that he can that he agrees with the black communities concerns, he fears that someone like him will get backlash as he’s not a minority in the sense, and therefore, doesn’t understand what they’re going through.  It’s a bridge that has been divided for ages, where people like Spokane NAACP president Rachel Dolezal can claim to be an African-American, but as a Caucasian, she took things too far by pretending to be black, yet claiming discrimination from a historically African-American university for being white.  It’s that type of thinking of believing you can have it both ways when you can’t that Macklemore alludes to here, as he can appreciate Blacks Lives Matter but can’t step into their shoes as a white person."
            }, {
                "paragraph": "Later in the second verse, comes these bars 'You speak about equality, but do you really mean it? / Are you marching for freedom, or when it's convenient? / Want people to like you, want to be accepted / That's probably why you are out here protesting.'  To me, it’s saying that you can act offended when someone is hurt or attacked for their skin, religion, sexuality, etc., but you’re only aware of it because you heard about it somewhere.  Most of the time, people like this act like something needs to be done, yet don’t understand anything about the people themselves.  For example, you can decry racist attacks against the black community, yet until you’ve actually spent time with the black community, you really have no perspective on what they’re actually fighting for, how they feel about society, etc.  It’s akin to fighting with them, but from afar.  Again, this segregation of sorts makes things worse.  While it’s true that minorities like to stick together, it also is not going to accomplish much in healing racial divides.  And for those in the majority, it diminishes your fight to protect minorities when you have no strong understanding of what you’re fighting for, instead fighting for a cause simply to be fighting for a cause."
            }, {
                "paragraph": "The third verse focuses on Macklemore’s own career and how some people may like him solely for being white.  With lines such as 'Even an old mom like me likes it cause it's positive / You're the only hip-hop that I let my kids listen to / Cause you get it, all that negative stuff isn't cool / Yeah, like all the guns and the drugs /The bitches and the hoes and the gangs and the thugs,' Macklemore suggests that being white makes him perceived as positive, while black rappers are all stereotyped as gangsters and thugs.  Even though there are many black rappers who aren’t gangsters and thugs, such as Common, Talib Kweli and Lupe Fiasco, to name a few, they don’t get the same ‘respect’ as Macklemore receives for their lyrics, nor do they enjoy the same commercial success Macklemore has achieved."
            }, {
                "paragraph": "One line that really struck me was on the following verse, where Macklemore writes 'It seems like we're more concerned with being called racist / Than we actually are with racism.' I find that line to be particularly powerful as many people don’t even think about racism or its effects on society until they say something perceived as racist and are called racist.  It’s only then that the person even thinks about racism.  Many times, I’ve heard people say stupid things that people interpret as racist, and the first thing these people say is 'I’m not racist.'  It’s another part of being unwilling to deal with racism and its repercussions until someone accuses you of being racist because you said something that stereotypes minorities, black or not."
            }, {
                "paragraph": "Another line that perfectly sums up Macklemore’s views on white privilege is from these bars 'But the one thing the American dream fails to mention / Is I was many steps ahead to begin with / My skin matches the hero, likeness, the image / America feels safe with my music in their systems / And it's suited me perfect, the role, I've fulfilled it / And if I'm the hero, you know who gets cast as the villain.' It’s this type of understanding that led Macklemore to text Kendrick Lamar after winning the Grammy for Rap Album of the Year in 2014, telling Kendrick Lamar he deserved to win the award.  Macklemore felt that being white led to the voters to favor him over the black artists he was faced against.  With the recent controversy over the lack of diversity with the Oscar’s, with the majority of its voters old and white, voting for actors, actresses, etc. voting for white people, it’s easy to see why Macklemore released this song now (of course, it should be noted the track will appear on their upcoming album ‘This Unruly Mess I’ve Made’ to be released next month)."
            }, {
                "paragraph": "Perhaps the most striking line is featured at the end of his last verse, where he repeats: 'We want to dress like, walk like, talk like, dance like, yet we just stand by / We take all we want from black culture, but will we show up for black lives?'. It basically sums up the whole song, as people tend to ‘appreciate the black culture’ but don’t take the time to appreciate black people themselves, as if we are taking all the ‘cool parts’ while tossing aside the ‘bad parts’ of the black people (i.e. the pain and suffering).  It’s definitely something that needs to be addressed, not only in the hip-hop world, but society in general.  The majority of hip-hop fans are white, yet they have not suffered the same emotions that black people have in their lives.  They have no idea what it truly is like to be black, they just think it’s cool to talk slang, dance and dress all ‘fresh.’  At what point do the fans truly understand what’s going on?"
            }, {
                "paragraph": "So how does all of this equate to white privilege?  Musically, with the majority of fans white, whether it’s hip/hop, rock n roll, pop are whatever, it comes down to fans relating more to white musicians than black musicians.  When it comes to black musicians, they are too often stereotyped as being gangsters, when they may not be.  For white musicians, they are perceived different, as if they are less threatening, even though they may be just as bad.  For these fans, they like ‘black music’ because it seems cool, but yet they will never live their lives, never have the same perspective, and most likely never suffer the same pain.  Macklemore has enjoyed acclaim for his work, but chances are, a black artist would get less attention releasing songs like those Macklemore has released."
            }, {
                "paragraph": "What needs to happen to get past this?  For starters, we need to confront the issues head-on.  As Macklemore alludes to in the song, remaining silent does not accomplish anything, it’s basically implying that you’re okay with the status quo.  We need to come together, not fight from afar to make ourselves look better.  Most important thing is that we need to understand our own shortcomings.  Too many times, those in the majority don’t understand what it really is like to be a minority, to wonder if you’re being targeted for being a minority.  It’s also difficult for the majority to understand why minorities think that they’re being targeted.  Some of it is environmental, some of it is sociological, some of it is pure genetics.  Unless you can walk in their shoes, which you can’t really do, the white majority will never understand the pain and suffering the minorities suffer, nor will they realize how much easier it is to be in the majority.  Studies have suggested in the past that people have racist tendencies, whether intentional or subconscious racism, it's up for us to decide whether to ignore it or do something about it."
            }
            
        ],
        "image": [{
                "name": "/static/img/white.jpg",
                "caption": "White Privilege II - by Macklemore and Ryan Lewis"
            }, {
                "name": "/static/img/macklemore.jpg",
                "caption": "Macklemore performing a song."
            }
        ]
    },

    "Why Flint Matters": {
        "title": "Why Flint Matters",
        "date": "January 20, 2016",
        "description": [{
                "paragraph": "A few months ago, while campaigning for President, Donald Trump, known for stupid comments, remarked that President Obama made his stupidest remark ever when he declared ‘global warming’ our number one enemy.  Donald Trump, wanting to scare people into thinking everyone is going to be attacked by a foreigner any second now, wants to diminish global warming because his party doesn’t believe in it.  This of course is the same man who believes the Chinese created global warming to gain a financial edge.  But with the water crisis in Flint, Michigan, people should be more aware of global warming and the effect the environment in general has on our society."
            }, {
                "paragraph": "Yes, it’s true that terrorist attacks are bad, they kill people who don’t deserve it, and they deserve to be punished.  But overlooking the global warming and environmental issues we face is more of a threat than terrorists.  Reason being, it affects everyone.  Nature doesn’t discriminate.  It doesn’t listen to reason.  It does whatever the situation provides.  Case in point, the water crisis in Flint.  In 2014, the Michigan state officials, determined to cut costs, temporarily used the Flint River as its water source, rather than Lake Huron, where they had been getting its water from.  They did so despite the fact that the Flint River was known to be disgusting.  They overlooked the environmental concerns by putting money first, and voila, they brought water with dangerously high levels of lead into every household in Flint, Michigan.  They eventually switched back to Lake Huron, but the damage was done."
            }, {
                "paragraph": "Almost two years later, a full-blown crisis has developed in Flint.  It’s unsafe to drink the tap water, and unsafe to bathe or shower in it.  Imagine living in a place where its water, which can be found everywhere, is dangerous and toxic.  Everyone needs water, to drink, to clean, to bathe, etc.  Yet Michigan state officials have slowly responded to an issue two years in the making, claiming it wasn’t a concern, yet people knew their water looked, smelled and tasted bad.  They overlooked the high levels of lead, which never leaves your body once it enters it.  And despite switching water sources, it remains in all of its piping system, which is expensive to replace in a city of 100,000+ people."
            }, {
                "paragraph": "The city has spent much of its time using water filters for trying to get rid of the toxic lead in the tap water, and bringing in lots of bottled water for those to drink.  Yet this problem was preventable, as spending a few extra bucks could have either kept the water source at Lake Huron, or use an anti-corrosion agent that would have cleaned the Flint River’s water for $100 a day.  In an age where some politicians, like the Republican Governor of Michigan Rick Snyder, want to spend more money on the military fighting bogus wars than they do protecting the environment for those who live in the country, one must ask themselves, which is really worse, a terrorist attack or a city wide attack on water?"
            }, {
                "paragraph": "The fact that it’s taken two years to do anything major about it shows a lack of care for the environment.  With some people more concerned about cutting costs and building up our military to fight terrorists, clearly their priorities are in the wrong place.  9/11 killed 3,000 people, wounded many more, and frightened most Americans, yet living in a place where even the most ubiquitous thing available (water) is causing harm to everyone that comes in contact with it has more of an immediate effect on those around it.  This can happen anywhere, anytime without warning, and truth be told, natural elements have way more of an effect than ‘foreigners.’  So while Donald Trump can claim the environment isn’t worth protecting and global warming is a scam, would he or anyone like it living in Beijing, where the air is unbreathable most of the time, and people can only feel completely safe inside their home?  The rich money making man who only wants to profit doesn’t care, but the majority of people need these basic elements to survive and not get sick."
            }
        ],
        "image": [{
                "name": "/static/img/flint.JPG",
                "caption": "The Flint River, looks innocent, but quite deadly."
            }
        ]
    },

    "Making a Murderer: My Thoughts on the Steven Avery case": {
        "title": "Making a Murderer: My Thoughts on the Steven Avery case",
        "date": "January 19, 2016",
        "description": [{
                "paragraph": "Much buzz has surrounded the Netflix film-documentary ‘Making a Murderer,’ about a Wisconsin man named Steven Avery who spent 18 years in prison for a crime he didn't commit, only to get charged and convicted of murder just two years after his release from prison.  The show and the case has attracted a lot of attention, getting enough votes for a petition on the White House's website to require the White House to answer the petition (F.Y.I. Obama can't pardon Steven Avery as the case was tried in state court, not the federal court).  The big question on everyone's mind, did Steven Avery really kill Teresa Halbach, or did someone frame him for exposing corruption for his false conviction?  Here are my thoughts on the case."
            }, {
                "paragraph": "The backstory on how Steven Avery was convicted of rape in 1985 was ridiculous.  It was clear the Manitowoc County Police Department wanted to blame the crime on him no matter whether he did it or not and weren’t going to consider any other plausible theories.  They ran wild with that case and wanted him behind bars because they considered him trash.  It certainly wasn’t fair to treat someone that way.  And it really isn’t fair that the actual perpetrator, Gregory Allen, who they knew about for his past crimes of sexual assault was able to commit more (which he did).  That part of the story is indisputable, as DNA found on the victim cleared him of any wrongdoing in 2003, and concluded Gregory Allen as the real perpetrator."
            }, {
                "paragraph": "The real question many wonder is who killed Teresa Halbach?  A 25 year old photographer described with a heart of gold, she took pictures of cars at Avery’s workplace, and was one of the last people to see her before she disappeared.  But did he really kill her?  Some of the initial evidence provided seemed ‘too good to be true,’ like the key they found next to Steven’s dresser.  It seems odd to me that if he really did kill Teresa that a key would be left in open view and not disposed of.  That seems a little suspicious, especially when the police department spent 8 days on the property investigating after finding Teresa’s car on the property.  8 whole days…  That seems too much time to spend at one place.  Anything could’ve happened during that time."
            }, {
                "paragraph": "When they charged Steven’s nephew Brendan Dassey for being involved in the murder, the story got even more ridiculous.  The kid was only sixteen years old at the time and seemed too slow and not bright, yet after police interviewed him (without an attorney who wanted him to plead guilty, of course!) they came up with this elaborate story behind the murder, even though the interviewers were feeding him info and asking him questions.  Brendan didn’t come out with any information on his own, he was merely answering questions as he thought the police wanted him to.  And what was described made no sense.  Wouldn’t slitting someone’s throat repeatedly led to physical evidence like blood in the room that allegedly took place?  Not surprisingly, none was found.  They had 8 days on the property, wouldn’t they have found blood on any of the searches they did on the property?  And all from some alleged confession of a sixteen year old with a below average IQ and easy to take advantage of."
            }, {
                "paragraph": "Not surprisingly, Steven Avery was convicted of two of three counts, including first degree murder.  What was interesting about the verdict was that initially seven jurors believed he was not guilty, yet they all changed their minds, three were certain he was guilty and two were undecided.  One juror ended up getting dismissed due to a family emergency, and he didn't believe there was enough evidence to convict Steven Avery.  And Brendan Dassey was convicted on all three counts, some of which were dismissed on Steven’s case but not in Brendan’s case.  How can he be convicted of rape, yet they dropped the charge from Steven’s case even though he was the ‘ringleader,’ or of mutilating a corpse, which Steven was found not guilty of.  It makes no sense to me."
            }, {
                "paragraph": "Is it possible that there’s no conspiracy and that Steven Avery really did kill Teresa Halbach?  It could have happened, but we really don’t know what actually happened.  Perhaps it was an accident.  Maybe Teresa said something to Steven that made him lose his temper and kill her.  Those things could’ve happened, but in the legal world, you need solid evidence of a crime happening in order to convict.  The evidence presented in the case was circumstantial at best.  No DNA of Teresa in the trailer, no blood of hers in the trailer or garage, no complete body or cause of death.  Just a few spots of Steven’s blood in the RAV4.  It’s possible the police planted evidence to prove Steven did it, even though Steven could have very well done it, there may have been no proof he did it.  You can never rule that out.  Based on the documentary, it doesn’t seem Steven would kill Teresa, but then again, everyone has that other side that they don’t want you to find out.  The side that made Steven snap in 1985 and forced his cousin off the road to confront her about rumors she spread.  There’s always that possibility as well, we really don't know or probably find out."
            }, {
                "paragraph": "Since it is a documentary, it paints a picture that Steven is innocent because he was falsely accused of rape in 1985, spent 18 years in prison for a crime he didn’t commit and sued the Manitowoc County police department for targeting him when they had another suspect (the real suspect) that they never pursued.  Now that the documentary has been released, Special Prosecutor Ken Kratz, who led the fight against Steven Avery at the Halbach trial, now says that additional evidence was left out of the show completely.  There’s so much stuff mentioned in the trial, they couldn’t include it all.  Not surprisingly, none of the evidence ‘left out’ would make Steven guilty on its own.  Calling Teresa’s business the day she showed up doesn’t prove anything, nor does the structure of the dresser with the key.  And while DNA on the RAV4 may sound special, it is really reliable?  And prison hearsay of Steven Avery talking about torturing women in torture chambers.  That was the most ridiculous thing said.  It wasn’t even used in the trial because it was unreliable, just like all prison snitches making ridiculous statements."
            }, {
                "paragraph": "Based on everything I have read on the case, I would not have convicted Steven Avery or Brendan Dassey.  Though I can’t say for certain if Steven is innocent, if you can’t prove he committed a crime, then he should have been found not guilty.  There is no strong evidence proving Steven killed Teresa.  It’s all circumstantial at best.  And the Manitowoc County Police Department tainted the investigation by getting involved when it wasn’t supposed to.  It’s possible they planted evidence, but it’s possible they didn’t.  The big question is, why would someone kill an innocent woman just to frame someone?  Teresa Halbach didn’t deserve to die, and I have a hard time believing the police would kill her just to punish Steven Avery.  As for Brendan Dassey, he got screwed by the system.  I don’t believe he did anything wrong, they just targeted him for being seen with Steven the night Teresa disappeared and because he’s not very smart.  His first defense attorney openly worked with prosecution to get him to plead guilty for something he didn’t do.  His ‘confession’ was made under pressure and probably coerced by the police.  They knew they could take advantage of him."
            }, {
                "paragraph": "As of now, Steven Avery’s case has been taken over by high-powered defense attorney Kathleen Zellner, who won exonerations for 17 wrongfully convicted criminals.  An appeal has been filed, claiming the police searched his place without a valid warrant, and also claiming a juror pressured other jurors to convict him.  Whether any of this helps Steven Avery will remain to be seen.  As time goes on, technology gets more powerful and can make it easier to prove guilt or innocence in a crime.  Down the road, better testing can better prove if EDTA was in the blood sample in the RAV4.  Perhaps the bones they found can produce better evidence to tie or not tie Steven to the case.  But Steven has spent too much time in prison, first for a crime he didn’t commit, and now for a crime he may or may not have committed.  As someone who likes conclusive evidence, I believe Steven should be released from prison, because at the end of the day, the only people who really know what happened is Steven Avery and Teresa Halbach.  No one else knows for certain who committed the crime, and if people like Casey Anthony, George Zimmerman and O.J. Simpson are given the benefit of the doubt, why not Steven Avery.  Innocent until PROVEN guilty, emphasis on the word proven."
            }
        ],
        "image": [{
                "name": "/static/img/murderer.jpg",
                "caption": "Making a Murderer, starring Steven Avery (kid and adult)"
            }
        ]
    },
    "How to Make My Website": {
        "title": "How to Make My Website",
        "date": "January 11, 2016",
        "description": [{
                "paragraph": "After the official launch of Bodie Web Design 2.0 (as I call it), I received a lot of nice compliments from those who checked it.  Thank you all for your nice words.  One comment from my wonderful Auntie Sheri was that she loved it, and that she could make this web page too.  So with those comments, here is how I made Bodie Web Design 2 and how you could too."
            }, {
                "paragraph": "First up is the prerequisites programs needed to run the website.  Node.js, the popular server-side JavaScript runtime environment, is used here.  Everything that runs my website is setup through a few lines of code that Node.js interprets and runs the code."
            }, {
                "paragraph": "Another program needed is closely associated with Node.js, which is NPM, it's package manager.  Once this is downloaded, you can access all the dependencies needed for your website, whether it be the use of a templating language such as Jade, or a task-runner like Gulp which can manage your tasks so they are easier to perform than manually doing it yourself."
            }, {
                "paragraph": "Once NPM is installed, now you can download the Express package, which is the framework I used for making this site.  You can either install it manually or use Express-Generator (the easier way) which creates a skeleton of your project.  "
            }, {
                "paragraph": "Now that all the prerequisites are installed, you can actually start working on your project.  The first thing to do is to set up your routes.  This is important as it tells your program which page to go and what to do when you reach that page.  Start by using express itself, which can be done by setting a variable, like so:  var express = require(‘express’);.  Now you can use express and all its methods, primarily the express method.  Set another variable equal to this method like so: var app = express();.  Now you can use the get() method to set your routes, which takes two parameters, the route it’s going to as the first, and an anonymous function as the second parameter, which contains everything that route is supposed to have."
            }, {
                "paragraph": "After the routing is done, you can start working on your templates, which consists of the views to be used.  With Jade, you can you partial templates, extend other templates into templates, all in accordance to DRY (Don’t Repeat Yourself).  Of course, to use Jade, you can use the app.set() method to set the view engine as Jade (view engine is the first parameter, jade is the second).  Now it’s ready to use, whether you want to extend the main layout template, or include a partial template not meant to be used by itself."
            }, {
                "paragraph": "Now you can add all of your static files; images, CSS, JavaScript, jQuery plugins, etc. Like everything else, it needs to be added to the main js file that keeps all of our basic in’s and out’s for our web page.  Not surprisingly, you can’t use static files until it’s set up in the main js file, which the app.use() method is also used for, which contains the express.static() method as its second parameter that sets the path to the static files."
            }, {
                "paragraph": "Install any other dependencies needed.  I used Gulp, a task runner which let me set my own tasks to make certain parts of development easier.  For example, minifying your JavaScript code, which makes it smaller and easier to run, can be a pain to do manually, but with Gulp, all I have to do is run a task and it will automatically minify the file and place it into the correct folder based on the task."
            }, {
                "paragraph": "When you’re done with the web page, you can upload it on-line to get it up in the real-life world of the Internet.  I chose Amazon Web Services to upload my project, using  Elastic Beanstalk to upload and manage my web application.  After getting your project uploaded to GitHub, a new Beanstalk project needs to be created and configured for Express.  Once that is done, deploy your GitHub zip file that is compiled with your most recent commit to your repository, and your website is up and running like mine is!"
            }
        ],
        "image": [{
                "name": "/static/img/lincoln.jpg",
                "caption": "Making websites is fun!"
            }
        ]
    },
    "College Football Championship Preview": {
        "title": "College Football Championship Preview",
        "date": "January 4, 2016",
        "description": [{
                "paragraph": "A week from today, the college football season ends with the national championship game between #1 Clemson and #2 Alabama.  A fitting championship game between the two best teams in the country.  Seeing Clemson slow down Oklahoma’s high powered offense and Alabama completely shutting Michigan State down, it’s clear these two were on a collision course for quite some time.  So who wins the big game?  Here are my two cents."
            }, {
                "paragraph": "To make things clear, I’m rooting for Clemson in this match-up.  I can’t stand Alabama and especially coach Nick Saban, the president of the ‘Let’s try to kill Oregon’s high speed offense by whining the the Rules Committee Club.’  Nick Saban can complain that it affects safety, despite a lack of evidence.  He can compare it to smoking cigarettes.  But a great coach would be up to the challenge of stopping such an offense.  While people laugh as his vice-president, Arkansas coach Bret Bielema, Nick Saban acts high and mighty walking around as if the college football universe revolves around him.  The SEC as a whole is like this, and Nick Saban personifies this."
            }, {
                "paragraph": "I also like Clemson as they are located in South Carolina, where my Bodie roots are, and from what I can tell, at least some of my family there are Tiger fans.  Plus my Grandpa back in the day always enjoyed watching the Clemson-South Carolina game.  But there’s more to Clemson to root for this year: They are 14-0, trying to become the first college football team to finish the season 15-0.  That would be a big accomplishment when it’s hard enough as it is to go 13-0, let alone 14-0.  So will this be the year Clemson accomplishes history or will they revert to their old ‘Clemsoning’ days?"
            }, {
                "paragraph": "Offensively, Clemson has more threats than Alabama, including their star QB DeShaun Watson, a dual threat quarterback that can give Alabama’s defense fits.  Against Oklahoma, he was hitting on all cylinders, on the ground and through the air (though it wasn’t until the second half until Clemson started to pull away).  Alabama has Heisman winning RB Derrick Henry, a talented runner and a top priority for Clemson, but Alabama also has wide receivers to throw to as well, as Michigan State learned the hard way in the Cotton Bowl.  With a plethora of options for Clemson, they have the slight edge."
            }, {
                "paragraph": "Defensively, Alabama gets all the credit for its hard nose tackling and for slowing games down, but Clemson also has a great defense that deserves credit.  But as in the past, Alabama has struggled at times against dual threat quarterbacks.  While Watson isn’t the fastest, he is smart."
            }, {
                "paragraph": "Coaching wise, this is Clemson coach Dabo Swinney’s first National Championship game.  After years of coming close and choking at the wrong time, a phenomenon that’s become known as ‘Clemsoning,’ Dabo, with his most complete team ever, will pour his heart and soul into the game.  Nick Saban, the Alabama coach, has been in this position multiple times as a head coach, and knows what it takes to win the big game."
            }, {
                "paragraph": "So who wins the big game?  Clemson was viewed as an underdog against Oklahoma and won easily, now they come into this game as an underdog as well.  The disrespect card is clearly enough to motivate Clemson.  Alabama claims disrespect after losing to Ohio State in last year's playoff.  It will be a great matchup, but in the end, my prediction is that Clemson wins 24-17."
            }
        ],
        "image": [{
                "name": "/static/img/clemson.jpg",
                "caption": "Clemson Quarterback DeShaun Watson."
            }, {
                "name": "/static/img/alabama.jpg",
                "caption": "Alabama Running Back Derrick Henry."
            }
        ]
    },
    "Militiamen: Anti-Government Hypocrites": {
        "title": "Militiamen: Anti-Government Hypocrites",
        "date": "January 3, 2016",
        "description": [{
                "paragraph": "On January 2nd, 2016, a group of militiamen, led by Ammon Bundy, the son of famed anti-government law breaking tax cheat Cliven Bundy, took over a federal building at the Malheur National Wildlife Refuge in Burns, Oregon.  Though Burns is on the other side of the state (and a completely different world than where I live), it’s insulting that these idiots are fighting to ‘save’ two local ranchers, Dwight and Steven Hammond, whom have accepted their faiths to report to prison for their crimes and it’s even stupider that these anti-government wackos think that they can do whatever they want as long as they wave their guns and American flags in the name of freedom."
            }, {
                "paragraph": "The U.S. Government is in charge of our country, and they have a right to protect their land as they see fit.  Whether it’s preserving our precious landmarks or protecting endangered species, the government has a right to step in and keep people from destroying something of value.  Wildlife Refuges are built to protect animals, plants and other forms of non-human life.  Militiamen believe that all land is for the people and that they should be able to do whatever they want with it, but that is not how things work."
            }, {
                "paragraph": "People can’t break the laws, and doing something illegal or doing something where you aren’t supposed to do said things is never justified in the name of ‘fighting the government.’  It is still against the law.  The Hammonds started a fire on land that wasn’t their land, and have done so multiple times.  Arson is a crime, and lighting fires to cover up other crimes is also unacceptable.  Anti-government wackos can act like the rules don’t apply to them, but at the end of the day, if you’re told you can’t do something, don’t do it.  That’s why the ranchers have accepted their prison sentences and don’t speak for the actions of these losers."
            }, {
                "paragraph": "But like any anti-government group, they only fight a specific cause, often hiding behind the second amendment to protect themselves.  So clearly, they have no problem following the second amendment, understanding its purpose tooth and nail, but the other things they don’t like, it doesn’t matter if it’s there or not, because they have a right to fight the government, and not the other way around (again, hypocritical).  It’s ironic to think that an organization that is against the government is using laws written by the government to protect them, that all they have to do is wave their guns to keep the government away.   They’re no different than any other criminal organization that threatens to shoot those who are after them if they try to bring them down, because they are domestic terrorists out to fight the government, breaking laws just to get their way."
            }, {
                "paragraph": "It’s a fight for them to get everything they want for nothing.  They illegally own land, yet refuse to pay taxes or fees on it, like Cliven Bundy has done for all these years.  So the militiamen can call it fighting all they want, I call it mooching off the government.  And yet they keep the government, like any other criminal organization, from arresting them by waving their guns.  Anyone who owns a home pays property taxes, regardless of whether the land is owned by the government or not.  Just because these people want to own land that’s not theirs, doesn’t mean that they can get it for nothing."
            }, {
                "paragraph": "So at the end of the day, these idiots can claim that they can do as they please, that they can take whatever land they want, but the United States has a government in charge and able to protect what it feels needs to be protected, and they have laws designed to make sure people follow them and not brake them.  The ranchers have accepted it, the people of Burns understand it, but these militiamen with no connection to the city or state want to cause trouble for their own self-gain."
            }
        ],
        "image": [{
                "name": "/static/img/malheur.jpg",
                "caption": "The Malheur National Wildlife Refuge in Harney County, Oregon."
            }
        ]
    },
    "Minnesota Golden Gophers 2015 Football In Review": {
        "title": "Minnesota Golden Gophers 2015 Football In Review",
        "date": "December 30, 2015",
        "description": [{
                "paragraph": "The 2015 season for the Minnesota Golden Gophers didn’t quite meet the expectations that many fans might have had after a well-played 2014 season, but yet despite the bumps in the road, Minnesota is showing signs of life as a competitive football team.  Whether 2016 will be any better remains to be seen, but at the moment, Minnesota did vanquish at least one demon."
            }, {
                "paragraph": "The season began with a hard fought loss to highly talented and then highly ranked TCU.  A team with an explosive offense was held to just 23 points by Minnesota’s defense, and playing at home, Minnesota definitely took advantage of the crowd to the best of their abilities.  But alas, the more talented team won.  Despite this, Minnesota’s hopes still remained.  The rest of the non-conference games, against Colorado State, Kent State and Ohio were all much closer than they should have been, mainly because Minnesota’s offense struggled to get going, but yet they won their games, even completing a late fourth-quarter comeback against Colorado State, which ended up in overtime and a win."
            }, {
                "paragraph": "The conference schedule to say the least was quite brutal.  Of their seven losses on the year, six of them were to ranked teams, the aforementioned TCU, Northwestern, Michigan, Ohio State, Iowa and Wisconsin.  They notable faced Michigan, Ohio State and Iowa three weeks in a row.  Though Minnesota wasn’t beaten particularly badly in any of those games, they still could not pull the signature win they needed.  The biggest heartbreaker came against Michigan."
            }, {
                "paragraph": "The same week Michigan came to town, coach Jerry Kill was forced to retire due to his seizure problems returning.  Not an easy choice for a coach who practically bleed footballs, but Kill’s health is more important, as part of the intensity that got him to where he was was contributing to his seizures.  It was a sad day for the Golden Gophers when he left, but yet to me, Jerry Kill has perhaps started a foundation that I hope stays with the Golden Gophers for many years to come.  Then came the Michigan game, which Minnesota outplayed Michigan virtually the entire game, but with 19 seconds down by three, Minnesota appeared to have caught the winning touchdown, but replays showed him inches short.  Perhaps due to being shocked and frazzled, Minnesota let the clock run down far too much and eventually tried to sneak in the winning touchdown, as opposed to tying it with a field goal.  Sadly, quarterback Mitch Leidner was stuffed by the defense."
            }, {
                "paragraph": "The Gophers were competitive, but ultimately, the Golden Gophers finished the regular season 5-7.  But despite the losing record, in these days, where we have way too many bowl games, there weren’t enough winning teams to place in all 40 bowl games, as with only 77 teams .500 or above, 3 teams with losing records had to be invited to play.  For once, academics paid off, as Minnesota had one of the highest Academic Progress Rates amongst the 5-7 teams.  Thanks to this criteria, Minnesota joined Nebraska and San Jose State in the bowl games.  Thus, Minnesota was off to the Quick Lane Bowl to play Central Michigan.  With Minnesota making no apologies for being there, not wanting to finish 5-8 and the extra motivation of a seven game bowl losing streak (who could forget the 31 point lead they blew in 2006 in the Insight Bowl to Texas Tech), Minnesota ended its season with a high note, beating Central Michigan 21-14 to win the Quick Lane Bowl."
            }, {
                "paragraph": "Looking back, the season was a minor disappointment, but with an incredibly tough schedule (with teams like Michigan and Iowa, whom the Gophers had beaten last season, were far better teams this year), and losing key offensive players David Cobb and Maxx Williams last season definitely hurt the Gophers.  Maxx Williams is hard to replace, a freakishly talented tight end, and while Minnesota have some young talented running backs with Shannon Brooks and Rodney Smith, neither one could replace the talent of Cobb.  On the plus side, Mitch Leidner, though he started off really slow, he found his rhythm later in the season, showed his heart and helped the Gophers win their bowl game.  Their defense played well, but had their weaknesses as well which need to be fixed.  And as for the coaching staff, Tracy Claeys, Jerry Kill’s trusty defensive coordinator, was promoted to head coach a couple of weeks after Kill stepped down.  The Gophers have a bright future ahead, a stable coaching staff and a fanbase that’s starting to show up and appreciate the team.  Let’s hope 2016 is a step in the right direction."
            }
        ],
        "image": [{
                "name": "/static/img/gophers.jpg",
                "caption": "The Gophers celebrate winning the Quick Lane Bowl."
            }
        ]
    },
    "Hip-Hop 2015: The Year it Was": {
        "title": "Hip-Hop 2015: The Year it Was",
        "date": "December 20, 2015",
        "description": [{
                "paragraph": "Another year has gone by, and for an avid hip-hop fan like myself, I can sum up the year in general as mediocre.  While Kendrick Lamar continued his onslaught as the most talented rapper at the moment (with apologies to legends like Eminem or Nas, who were relatively quiet this year), many of the highly regarded albums in the world of popular rap were filled with syrupy R&B beats and ridiculous R&B singing in their raps (here’s looking at you Fetty Wap).  While there were plenty of rappers with rap albums who actually rap, the most attention still ends up with Drake, whose corny beats, pointless beefs and a collaboration with equally lame rapper Future dominated the news."
            }, {
                "paragraph": "The biggest surprise of 2015 of course came in August, when Dr. Dre finally released his follow-up to his 2001 album many years ago.  No, it wasn’t Detox, but rather, Compton, an album inspired by the N.W.A. biopic Straight Outta Compton.  But while this was a great surprise, most of the headlines revolved around the incredibly lame beef between Drake and Meek Mill.  Gone are the days of rappers actually rapping their verses, now we're forced to hear stupid twitter rants and uninspired battle raps.  Clearly the whole thing was a publicity stunt by Meek Mill to promote his album.  Too bad Meek Mill has never been much of a lyricist.  But I digress."
            }, {
                "paragraph": "My favorite hip-hop moment of the year came from perhaps the oddest thing ever to happen to hip-hop.  Run the Jewels, once the most unlikely group, now the best group out right now, released their remix album 'Meow the Jewels,' an odd yet entertaining remix of their Run the Jewels 2 album, featuring nothing but cat sounds.  What started off as a joke became a reality thanks to the plethora of producers interested in making it, and the ensuing fan funded drive to release the album (all proceeds went to charity).  Where else can you find Snoop Dogg singing the Meow Mix song on an album so humorously or Just Blaze acting hysterically over a cat invasion but Meow the Jewels."
            }, {
                "paragraph": "Though many popular rappers on the radio suck and can’t make a good song, there is hope for hip-hop.  One rapper I discovered this year that impressed me is Mick Jenkins, a young rapper out of Chicago whose mixtape The Water[s] (released last year) was well done and thought out.  A better example of Chance the Rapper (who also comes from the same collective of new rappers from Chicago), Mick Jenkins jazzy production and lyrics about water impressed me.  With lyrics like 'Water more important than the gold / People for the gold / Everybody do it for the gold / People save your souls,' Mick cleverly uses water as a metaphor, which he does throughout the project.  He also released Wave[s] this year, a follow up with similar themes, jazzy production and lyrical talents."
            }, {
                "paragraph": "Another rapper I discovered is the young musician Raury, who blends all kinds of music, from rap, rock, folk, soul, etc.  I first heard him featured on the excellent Joey Bada$$ song Escape 120, but later listened to his debut project ‘Indigo Child,’ which finds Raury all over the place, somewhat similar to Andre 3000.  God’s Whisper was easily one of my favorite tracks of the year, and the sequel Devil’s Whisper (off his recently released debut All We Need, which I haven’t fully checked out yet) is just as impressive."
            }, {
                "paragraph": "As I look back at 2015, I realize how more distant I am from mainstream music.  One way I can tell is through XXL's Freshmen Edition, a list of 10 or so rappers they believe are going to be the 'next hot thing.'  The list has degraded in quality since 2010, and this year's list was mostly awful: Vince Staples, Goldlink, Raury, Dej Loaf, Fetty Wap, K Camp, Shy Glizzy, Tink, OG Maco and 'The Peoples Champ', Kidd Kidd.  Here's my opinion on each"
            }, {
                "paragraph": "Vince Staples: A young street smart kid from LA, the only one on the list I had extensive knowledge of prior to this list coming out.  Not a bad lyricist, enjoyed some of his mixtape tracks, but couldn't get into his debut Summertime '06."
            }, {
                "paragraph": "Goldlink: A talented yet mysterious artist from D.C.  Found myself listening to his The God Complex album.  His lyrics aren't the best but his production style is quite enjoyable, future bounce is I believe what they call it.  Sober Thoughts is a great song that sounds like it came from the 90's, with a chilled vibe."
            }, {
                "paragraph": "Raury: As previously mentioned, Raury is a young electric musician from Atlanta, who incorporates all types of music into his repertoire, hit the scene last year with his mixtape 'Indigo Child.'"
            }, {
                "paragraph": "Dej Loaf: A female rapper from Detroit who sings more than she raps.  Back Up w/ Big Sean a catchy song but otherwise she does nothing for me."
            }, {
                "paragraph": "Fetty Wap: How a one-eyed rapper with ugly dreadlocks can score so many hits is beyond me.  He sounds like a bad reggae artist when he sings, and he thinks that makes him different?  Most rappers sing these days.  Next..."
            }, {
                "paragraph": "K Camp: Another singing rapper with stupid lyrics.  He sounds more like a singer but I doubt he'll be relevant five years from now."
            }, {
                "paragraph": "Shy Glizzy: Funeral is a nice song, but otherwise he doesn't seem special at all."
            }, {
                "paragraph": "Tink: Another singing female.  Woopty doo!  Pass..."
            }, {
                "paragraph": "OG Maco: I heard one song of his, he sounds bizarre.  Plus that blond hair does nothing but make him look creepy."
            }, {
                "paragraph": "Kidd Kidd: Once affiliated with the G-Unit, that's all I know about this guy.  Haven't even listened to him yet."
            }, {
                "paragraph": "Quality songs worth mentioning that came out this year include a couple of great songs from A$AP Rocky, the Rod Stewart sampled and featured ‘Everyday’ and the Juicy J and Pimp C featured ‘Wavybone’ that sounds like the perfect song fitting his New York/Houston hybrid style that often comes with mixed results.  The aforementioned Devil’s Whisper showcased a great and unique style from the young Raury.  Macklemore & Ryan Lewis made their comeback with the somewhat clever/somewhat corny song Downtown, featuring old school rappers Melle Mel, Kool Moe Dee and Grandmaster Caz, in a song showcasing various old styles of music.  Even Snoop Dogg found a quality song with a funk throwback Peaches & Cream (who needs that reggae shit)."
            }, {
                "paragraph": "Also good were the following tracks: Alpha Omega by Machine Gun Kelly, Young Jesus by Logic, R.I.C.O. by Meek Mill (the song that started his stupid beef with Drake), Senorita by Vince Staples, Blessings by Big Sean, Money Trees Deuce by Jay Rock, Every Ghetto by Talib Kweli & 9th Wonder, and Iron Rose by Cannibal Ox (I never thought the duo would reunite after their breakup many years ago)."
            }, {
                "paragraph": "With all of that said, there were some quality albums released this year.  Not quite as strong as years past, but still enough to make this rap fan satisfied.  There were also some quality songs from otherwise mediocre artists.  Here are my top nine albums of 2015 (no mixtapes included, with apologies to the Run the Jewels Meow the Jewels remix album), because I could only find nine albums to get."
            }, {
                "paragraph": "1. Kendrick Lamar - To Pimp A Butterfly: In a time where most rappers make crappy songs to get on the radio with little effort in their music and meaning, one rapper, Kendrick Lamar, excels amongst the other newcomers with his lyrical jaunts, unique production and capturing the raw emotions of all things Kendrick Lamar.  Tasked with outdoing the incredible Good Kid, M.a.a.d. City, Kendrick Lamar continues to show how to make quality music and get the deserved attention without obvious radio play.  With perhaps the best song of the year, the intense ‘The Blacker the Berry,’ Kendrick raps about the hypocrisy of gang violence, declaring himself ‘I'm the biggest hypocrite of 2015’ which he concludes by rapping 'So why did I weep when Trayvon Martin was in the street? / When gang banging make me kill a nigga blacker than me? / Hypocrite!'.  Featuring a more funk-based version of Kendrick’s jazzy stylings, Kendrick not only puts out songs with great beats, but those with thoughtful lyrics, including the inspiring ‘Alright’ where he proclaims ‘we gon be alright’ and 'Alls my life I has to fight, nigga,' a song has since been nominated for ‘Song of the Year’ at the Grammys, along with the funky ‘King Kunta,’ psychedlic and sexually-charged ‘These Walls,’ and of course, the popular i, remixed for the album with a slightly different beat, drawing more attention to the song’s message (and acapella at the end to Oprah). Kendrick Lamar proves again why he is the best rapper out right now."
            }, {
                "paragraph": "2. Dr. Dre - Compton: Undoubtedly the surprise album of the year, coming completely out of nowhere and off guard, Dr. Dre proves that he still has the musical genius in him to craft a great album, even when so much has changed over the years.  Dr. Dre perfectly blends the classic sound with an updated twist on the magnificent ‘Genocide’ and ‘Darkside/Gone.’ With guest appearances from his talented group of rappers over the years, from Snoop Dogg to Eminem (Even if my image ends up taking a personal hit / Whoever I hurt or whatever bridged I burned /In this bitch and whatever bitches feel like / They didn't deserve what I did / And whatever consequences with every verse, it's worth it / So Doc turn the beat on, whose turn is it to get murdered on it?) to Kendrick Lamar (Once upon a time, I shot a nigga on accident (boom, boom, boom)/ I tried to kill him but I guess I needed more practicing (boom, boom, boom)/ That's when I realized banging wasn't for everybody/Switch it up before my enemy or the sheriff got me), along with newcomers like Jon Connor(I told my city 'Hold me down', now look how high they hold me up / I'm Kobe clutch, I hold my nuts 'fore I was old enough to cuss), Dr. Dre provides a fitting end to his rap career."
            }, {
                "paragraph": "3. Joey Bada$$ - B4.Da.$$: The debut album for the young and talented Joey Bada$$ features him in his comfort zone; boom-bap east coast based production nostalgic of the great underground New York sound of the late 90’s.  Joey, appreciative of the classic sound, hooks up with legends like DJ Premier, along with new legends like Statik Selektah in creating an album fitting of the era, yet with his lyrical prowess and themes fitting for himself.  A step up from his previous works though not perfect by any means, Joey Bada$$ showcases his style of music via the Scenario inspired ‘No. 99,’ the touching ‘On & On,’ and the experimental ‘Escape 120’ featuring up-and-comer Raury.  At age 20, Joey Bada$$ is clever enough to draw attention (via his cleverly titled album, ‘Before Da Money, or another way to spell his own name), yet like many of the greats, Joey has bright years to come to reach the full potential, with lyrics such as 'Cause every time I make a move they be sweatin' me / They want another black man in penitentiary / It's even hard for that man standing next to me / Cause he could catch a bullet that was really meant for me' showcasing his awareness of police brutality in the ghetto."
            }, {
                "paragraph": "4. Action Bronson - Mr. Wonderful: The ever colorful rapper Action Bronson, with sick and crazy lyrics and a penchant for just having fun on his songs, releases his studio debut, Mr. Wonderful.  A departure from his rugged East Coast raps, Action Bronson goes all over the place with Mr. Wonderful.  Though it features traditional raps with ‘Easy Rider’ and ‘Actin Crazy,’ Bronsolino also flexes his experimental side with the bluesy vocals of ‘City Boy Blues’ and the Chance the Rapper featured ‘Baby Blue.’  Action Bronson provides a fun-filled album while maintaining his lyrical prowess, where you will be impressed with lyrics such as 'There were times I used to hide my feelings / Now I'm butt naked in the Lamborghini / And motherfuckers can't see me / Wait 'till the chick see me on TV, I make the shit look easy' but yet will sing along joyfully to 'I got a brand new car / I got a jazz guitar'."
            }, {
                "paragraph": "5. Mac Miller - GO:OD AM: Mac Miller, fresh off a roller-coaster ride that led him on a crazy drug binge and subsequently in rehab, released his most mature album yet with GO:OD AM.  Featuring Mac Miller having a more mature perspective on his crazy drug songs, Mac Miller releases his most honest work yet.  With tracks like ‘Break the Law’ and ‘In the Bag,’ Mac Miller shows he can still have fun on the record, but also shows his depth on the excellent two parter Perfect Circle/God Speed, which sees Mac Miller broken down and built back up with his spiraling drug use, with lyrics on Perfect Circle including, 'Yeah, blame the drugs, got me sinning on the weekday/Drunk as fuck, doing buck sixty on the freeway/Giving y'all the freebase, hidden in the middle of a briefcase,' while on God Speed he raps 'Them pills that I’m popping, I need to man up / It’s a problem, I need a wake up / Before one morning I don’t wake up' showing the redemption of his drug abuse."
            }, {
                "paragraph": "6. Yelawolf - Love Story: After releasing his disappointing debut Radioactive late in 2011, Yelawolf follows it up with a much more honest and fitting follow-up, the ironically titled Love Story.  Tapping into his southern roots, Yelawolf releases a surprising cohesive album, blending southern rock, country and even bluegrass while rapping about the pain and suffering he’s experienced since his debut album, with lyrics of struggles including 'Daddy I've been thinkin' about you lately / Mama's never here and step daddy hates me / He drinks a lot, it makes him so mean / Mama always screams and it gives me bad dreams.'  With Eminem as his only guest feature on the excellent ‘Best Friend,’ Yelawolf also finds his groove on the country inspired ‘Till It’s Gone,’ the funkadelic inspired ‘Outer Space’ or the Johnny Cash inspired track named after him.  Though not for everyone, Yelawolf finally feels comfortable here, and not rapping corny love songs he clearly didn’t want to make."
            }, {
                "paragraph": "7. Tech N9ne - Special Effects: Tech N9ne, always unpredictable and crazy, released his newest solo album, Special Effects in May.  As with any Tech N9ne album, Tech shows off a wide variety of styles, from the dark ‘Psycho Bitch III’ featuring equally the dark and crazy Hopsin with a show-stealing verse, to the party jams like ‘Hood Go Crazy,’ featuring B.o.B. and 2 Chainz (enough to show that Tech N9ne doesn’t go mainstream, mainstream goes Tech) and of course, the highly anticipated ‘Speeddm (WWC2)’ collaboration with the great Eminem showcasing the speed raps.  Special Effects, in a departure from his other albums, finds Tech N9ne in even more oddball styled songs, whether it’s Trap music or EDM, but yet Tech remains his lovely self, covering a variety of topics 'But why you gotta let the bodies dropping at a coffee shop in Aussie (Aussie, Oi Oi Oi) / But around here, loving coco's the bomb / Meanwhile so many people are taken out by the hands of Boko Haram / Aw yeah?!' as well as flexing his ability to flip words 'Just a crone phall, then it's on y'all / Fuck around and get ya dome sawed off a brone stawl / I can't wait to hear ya squeal and holler / How you set trippin' when you got a multi-dillion mollars, nigga'."
            }, {
                "paragraph": "8. BADBADNOTGOOD & Ghostface Killah - Sour Soul: Ghostface Killah, still strong after twenty years of success via the Wu-Tang Clan and many of his excellent solo albums, collaborated with Canadian jazz trio BADBADNOTGOOD to create Sour Soul, a nice relaxing album sure to satisfy Ghostface Killah’s longtime fans as well as those who like a more jazzy backdrop.  Though the album is short (and with three tracks out of twelve being instrumentals), Ghostface makes the best of his use, still capable of dropping dope lines 'Dangerous thoughts, mind of a militia / Bottles of the 1-50 poured over twistas / Broken bones and pillars,Staten Island the illest /The biggest land fillers, we creep like caterpillars '.  Featuring a show-stealing verse on ‘Six Degrees’ from the unpredictable and possibly insane Danny Brown 'What's on the menu? Eat a rapper like butternut squash / Bark on a nigga with the blade out / Run up in your safehouse, how ironic /Knock a ring on a nigga like somebody hit Sonic', along with songs featuring the underrated Elzhi and mysterious DOOM (still waiting for that collabo album), Sour Soul is a nice little project to relax to."
            }, {
                "paragraph": "9. Donnie Trumpet & The Social Experiment - Surf: The Social Experiment, a hip-hop/jazz/pop quartet fronted by Chance the Rapper, released their debut album Surf in May exclusively on iTunes as a free download.  Though Chance the Rapper is never going to win ‘lyricist of the year,’ with corny lyrics like ‘I got a future so I’m singing for my grandma/You singing too, but your grandma ain’t my grandma’ or ‘Bit of a pickle, she tuck her tommy/Rugrat, bare skin, fair skin,’ nor inspire people with his oddball adlibs, Chance the Rapper does get credit for maintaining a musical vision and not rapping ‘for the radio.’  Released for the summertime in mind, Surf is an interesting mix of hip-hop, jazz and pop blended in through the backings of The Social Experiment, with an impressive guest list including J. Cole, Busta Rhymes, B.o.B. and Big Sean.  Standout tracks include the jazzy ‘Miracle,’ the fun trumpet stylings of ‘Slip Slide’ and the sweet pop sound of ‘Sunday Candy’ which you can’t help but sing along to."
            }
        ],
        "image": [{
                "name": "/static/img/pimp.png",
                "caption": "To Pimp a Butterfly"
            }, {
                "name": "/static/img/DrDre-compton.jpg",
                "caption": "Compton"
            }, {
                "name": "/static/img/badass.jpg",
                "caption": "B4.Da.$$"
            }, {
                "name": "/static/img/wonderful.jpg",
                "caption": "Mr. Wonderful"
            }, {
                "name": "/static/img/goodam.jpg",
                "caption": "GO:OD AM"
            }, {
                "name": "/static/img/love.jpg",
                "caption": "Love Story"
            }, {
                "name": "/static/img/special.jpg",
                "caption": "Special Effects"
            }, {
                "name": "/static/img/soursoul.jpg",
                "caption": "Sour Soul"
            }, {
                "name": "/static/img/surf.png",
                "caption": "Surf"
            }
        ]
    },
    "Catching the Porzinger Fever": {
        "title": "Catching the Porzinger Fever",
        "date": "December 18, 2015",
        "description": [{
                "paragraph": "On the night of the 2015 NBA Draft, many people turned in to see which young prospects their team would select.  Though the NBA Draft was held in Barclays Center (home of the Brooklyn Nets), it's fans of the New York Knicks (who play in the Madison Square Garden, the traditional home of the draft) that are the loudest and most obnoxious.  Many of their fans don’t know a whole lot about all the prospects, mostly knowing those they see on TV, i.e. those who play for big time college basketball teams, which is why, when the New York Knicks selected a young Latvian kid named Kristaps Porzingis, they loudly booed the selection."
            }, {
                "paragraph": "Who could blame them?  For every Dirk Nowitzki that becomes a star, there's a Darko Milicic waiting in the wings to be subpar.  European players get more flack because they are largely unknown before coming over, but then again, for every LeBron James, there's Kwame Brown.  The whole NBA Draft is a crapshoot, you never know what you're going to get.  So was it justified for Knicks fan to boo 'the Latvian kid?'"
            }, {
                "paragraph": "Fast forward to December 2015, where after six weeks into the NBA Season, it has become fairly clear that Kristaps Porzingis was worth the high pick.  While he’s not the next LeBron James, averaging 13 points, 8 rebounds and 2 blocks a game at the time of this article, the Knicks have been far better than they were last year, with the help of his defensive prowess, dunking abilities and the ability to stretch the floor.  So why all the fuss?"
            }, {
                "paragraph": "He's only 20 years old, with plenty of time to improve his game, but standing at 7’3” and being more than a low post player, Kristaps Porzingis is immediately compared to Dirk Nowitzki, whose size and shooting skills (along with his heart) have made him one of the best NBA players of his generation and one of the best from Europe.  But Nowitzki does not have as strong of a post game as Porzingis shown.  Many people may forget how poorly Nowitzki played as a rookie, being called a bust, but by year two, Nowitzki starting showing off his skills and has since become the heralded great he is today.  Porzingis, by comparison, has looked fairly comfortable from the get go."
            }, {
                "paragraph": "What really makes Porzingis special is his unique combination of size, agility, shooting and strength.  Most big men his size cannot shoot from a distance.  They definitely are not able to keep up with the smaller players or play for long periods of time.  Whether Porzingis is able to sustain long-term success remains a big question, but if the Knicks manage him properly, he has the potential to be something special.  Much like LeBron James or Shaquille O’Neal, Porzingis is a physical specimen, a ‘freak of nature’ as they call it.  It’s difficult to defend a player his size that can shoot three-pointers with some consistency; 33% is much higher than 0% most 7-footers make.  Sometimes, having those unique and difficult to stop physical features is all some players need, even though most don’t have them."
            }, {
                "paragraph": "So the big question remains, why has Porzinger Fever caught on so quickly.  For one thing, he plays in the biggest market in the NBA.  Everyone gets attention in New York.  After all, how can anyone forget the two weeks Linsanity brought upon for the Knicks back in 2012.  Now that Jeremy Lin plays for the Charlotte Hornets, does anyone even care anymore?  Not really.  But combined with the fact that the Knicks have played much better than last year (which was awful by all standards) shows that the Knicks have someone who’s a winner.  Thirteen wins through mid-December is far far better than seventeen wins in an entire year.  He’s already racked up three endorsement deals (something that probably wouldn't happen in, for example, Charlotte) and people always love an underdog, even those who booed him on draft night.  He even gets bonus points for kind of looking like the young version of infamous Rocky IV fighter Ivan Drago.  So while it seems that the Knicks fans, and fans all over the world will root for just about anything that brings attention to their club, only time will remain whether Porzinger Fever is here to stay or just another case of Linsanity."
            }
        ],
        "image": [{
                "name": "/static/img/porzingis.jpg",
                "caption": "Will he break you?  Stay tuned to find out..."
            }
        ]
    },
    "Gun Violence: Honest Conversations Only Apply": {
        "title": "Gun Violence: Honest Conversations Only Apply",
        "date": "December 4, 2015",
        "description": [{
                "paragraph": "Dear America: We have an epidemic occurring through our nation and despite repeated outbreaks, none of our leaders are willing to figure a way to get it done.  In fact, many of them don't think we should do anything at all.  That epidemic of course, is gun violence.  So please America, let's have an honest conversation on how to best handle gun violence and stop with the lies upon lies we keep hearing."
            }, {
                "paragraph": "The first thing we must do is to have reasonable expectations.  There is no panacea for gun violence.  No matter what we do, some bad people are going to commit crimes with guns, but that's not an excuse to do nothing but 'send our thoughts and prayers' to those who die by a gun.  Time and time again, congressman complain 'there's nothing we can do about it' and 'nothing would have stopped so and so from committing this horrific crime.'  While this is true, the point of having laws is to try to reduce crime as much as possible.  There is no major law on the book that hasn't been violated.  Murder, rape, robbery, etc.  Just because many people commit these crimes, doesn't mean we shouldn't have them at all on the grounds that 'people will do it regardless of the laws'.  These same congressmen will do anything to shut down Planned Parenthood and make abortion illegal, yet ignore the fact that women who really want an abortion will get one even if illegal.  Clearly these congressmen have an agenda, it's not a matter of believing 'there's nothing we can do to stop gun violence.'"
            }, {
                "paragraph": "Other congressmen believe in banning assault weapons and other high-powered military styled weapons meant to kill people, not protect themselves.  Is this honestly achievable?  Of course not.  With all the AR-15's, AK-47's and Tech-9's in the world, a better approach is to go after those who shouldn't have them.  There will always be high-powered guns available no matter how hard these congressmen want them not to be, it's best to go after those who shouldn't have them.  Convicted felons love to stockpile on weapons, i.e. gangs, terrorists, psychopaths."
            }, {
                "paragraph": "Often times, we talk about background checks and how they can keep guns out of the hands of those who shouldn't have them.  Some people believe more tests somehow infringes on the rights of those who own guns, but yet the majority of responsible gun owners will pass background checks with flying colors, so who are these people trying to protect?  Those who shouldn't have a gun: the felons, mentally ill, terrorists, etc.  Do they really believe that we shouldn't have background checks at all, and just sell guns to whoever walks into a store?  There are plenty of loopholes where people can legally buy guns without background checks, like gun shows, and sales through family members.  What makes a gun show different than a store anyway?  Nothing.  And sure, most people who commit mass shootings pass background checks, but not all have.  And stronger background checks that better detect mental health issues could have prevented them from purchasing guns.  Dylann Roof, who shot and killed nine black members of a church in Charleston, should not have been legally allowed to purchase guns despite awaiting trial for drug and trespassing laws. John Russell Rouser, who shot and killed two people and wounded nine in a movie theatre in Lafayette, Louisiana before killing himself despite past legal troubles and documented mental health issues."
            }, {
                "paragraph": "Many liberal cities don't allow gun sales in their cities.  Places like Chicago, for example, have tight gun control rules.  But while this sounds like a good idea, it's unrealistic and ineffective at curbing gun violence.  For many who live in these cities, a quick drive to the next town, county or state over will bring a plethora of guns.  There are certainly no restrictions on buying guns in a different town than the one you live.  For this to work, it's either all or nothing, and with honest and responsible people owning guns within their rights, they have the right to buy a gun of their choosing."
            }, {
                "paragraph": "For many, mental health is seen as an underlying issue with gun violence.  Murderers like Adam Lanza, James Holmes and Seung-Hui Cho all had documented mental health concerns, yet were able to get a hold of lots of guns.  Yet the very people who claim we need to increase access to mental health treatment are the same people who want to make it more difficult to get access to the insurance they need to seek such care.  Heck, many of our mental health facilities were closed down in the 1980's by Ronald Reagan.  How has that helped our mental health situation?  And each time I hear someone talk about it, they offer no ideas to implement this, instead blaming it all on Obamacare."
            }, {
                "paragraph": "Truth be told, many people don't understand the significance of the deadliness of guns.  For Adam Lanza and Chris Harper-Mercer, their mother's were both gun fanatics who encouraged their sons to become immersed in guns, even buying them guns as presents.  Even worse, both of the parents were fully aware that their kids faced some sort of mental illness.  Classic examples of parents not thinking that their mental illness could lead their children to have violent tendencies.  And why is this?  Because these people see guns merely as used for protection and sport.  They never think their kid would use them to kill, but mental illness leads to irrational thoughts which could be violent."
            }, {
                "paragraph": "So why can we never have an honest conversation about the best ways to fight gun violence?  Organizations like the NRA simply put money and power over the voices and lives of American people.  The NRA will do anything to remain in power, and make record profits, and do so by lying to the public.  They scare gun owners by telling them every expanded background check, restriction and change of any kind is all about keeping guns out of their hands; that the government wants to make a National Registry so they can start taking away guns from innocent people.  Yet none of this is true, even when congressmen come up with bills that explicitly state 'We're not asking for a National Registry,' the anti-government gun fanatics won't believe it.  The NRA refuses to allow any changes at all, even closing loopholes that allow terrorists on 'No Fly Lists' to buy guns. And yet for all their claims that they care about safety and want to make things better, it never happens.  All they say is 'the laws we already have are fine and we need to enforce them better.'  Obviously, the only people the NRA are really fighting for is terrorists and felons, since they're the only ones affected by the background checks they claim is an infringement on your rights."
            }, {
                "paragraph": "It all plays into the NRA's hands.  More guns equals more money for the gun makers, and more power to the NRA.  They suggest more guns, more guns, more guns will stop the violence.  But it never does.  Unless you spend your whole life waiting for someone to shoot you, the shooter will always be more prepared to carry out an attack and have much more arsenal than a person protecting themselves with a handgun.  Anyone with common sense should know that a handgun is nowhere as powerful as high-powered military styled weapons and suicide bombs.  It's no coincidence that every time a major mass shooting is reported, gun sales spike dramatically and the NRA scares people into thinking ‘everyone needs more guns'."
            }, {
                "paragraph": "There are plenty of reasons we have so much gun violence.  Easy access to guns, people who believe everyone should be required to own a gun, an obsession with violent media, you name it.  Finding a panacea for this will never happen.  Doing nothing will only encourage those to continue committing crimes.  We must find a way to take a common sense approach that satisfies both sides of the spectrum.  It starts with having an honest conversation about guns, mental health and violence."
            }
        ],
        "image": [{
                "name": "/static/img/handgun.jpg",
                "caption": "This might be made to protect you..."
            }, {
                "name": "/static/img/ar15.jpg",
                "caption": "But this is designed to kill."
            }
        ]
    },
    "Thanks for the Great Memories Kobe": {
        "title": "Thanks for the Great Memories Kobe",
        "date": "November 29, 2015",
        "description": [{
                "paragraph": "When I was 11 years old, I liked to get NBA jerseys.  I loved the sport and thought it was cool to wear them.  Some of them I bought for the design, like Grant Hill's Detroit Pistons jersey with the horse logo (what would you expect, I was young and loved the animal logos, even the Toronto Raptors Dinosaur logo which, like Detroit's logo then looked hideous by today's standards).  Others were for my local team that I liked growing up, the Portland Trail Blazers, that of the great Arvydas Sabonis.  I even got a throwback jersey of Dr. J from the Philadelphia 76ers.  But there's one jersey which I still have to this day as a collector item, a rookie jersey of Kobe Bryant."
            }, {
                "paragraph": "As  a young'un, I followed basketball immensely, studying players stats, schools and heights down to the core.  There wasn't anything I didn't know from the 90's.  I can even tell you that Alaa Abdelnaby had a career game when I had surgery on my ears when I was six years old.  Why would I remember that?  Who knows.  But reading articles and whatever I could get my hands on, I became drawn to a kid that came straight out of high school in 1996, a kid named Kobe Bryant.  I don't know why I thought so highly of him as a rookie; he was young, raw and untested for the big game, coming off the bench and hitting airballs on occasion, yet Kobe won the Slam Dunk contest, which was a favorite of mine."
            }, {
                "paragraph": "So as I think of what to write, I reminisce over twenty years in the NBA for Kobe, from the highs to the lows, as Kobe announced today that this season will be his last.  I expected from the beginning that this would be his last season, after all, he hasn't been able to stay healthy the past few seasons, and especially this season, can't take it anymore.  Little did I know when I was 11 that Kobe would become arguably the best player of his generation, which for my definitional purposes is from 1998, when Michael Jordan retired from the Chicago Bulls for a second time in 1998, to 2010, when LeBron James joined the Miami Heat (and the last year Kobe and the Lakers won the NBA title)."
            }, {
                "paragraph": "As a young kid, my favorite team was the Portland Trail Blazers, since I lived in Portland, but at times I also liked the Los Angeles Lakers, since I had my relatives in L.A.  Though I was more of a Blazer fan due to their proximity, things began to change when the Lakers acquired Kobe Bryant from a trade in the 1996 NBA Draft from the Charlotte Hornets from Vlade Divac (whom was expendable as the Lakers signed Shaquille O'Neal to a monster deal that summer).  During the first two years of Kobe's career, I found myself more and more torn over who to root for.  On the one hand, the Blazers will still my local team, but the great lovable players of the era, i.e. Clyde Drexler, Jerome Kersey and Terry Porter were replaced with talented but malcontent players, i.e. Damon Stoudamire, Rasheed Wallace and the worst of them all, Isaiah Rider."
            }, {
                "paragraph": "It became more difficult for me to root for Portland when hearing about all the Blazers run-in's with the law, and the general manager Bob Whitsitt who did little to stop it.  I also had a difficult time when the Playoffs came and the Lakers and Blazers would face off in the first round of the Playoffs.  I wasn't the type to root for both teams, going back and forth.  That might fit my Uncle Mike, the San Francisco 49ers/Seattle Seahawks fan, but not for me.  By the time I was fourteen, I knew I had to root for one team, and toss aside the other.  Having been drawn into Kobe's potential, I chose the Lakers over the Blazers."
            }, {
                "paragraph": "Sure, the Lakers had a big star at the time, Shaq, and he was a unique player that in his prime, no one could ever stop.  But yet I found myself more into Kobe's demeanor and personality than anything else.  I also loved Kobe's little fro when he was young.  I was surprised when he shaved it off, and began to look like Michael Jordan, but I outgrew that and can't imagine Kobe without the shaved head.  Talent wise, Kobe became an elite player thanks to Phil Jackson."
            }, {
                "paragraph": "Phil Jackson, perhaps the best coach in NBA history, won six championships with Michael Jordan and the Chicago Bulls, so when he took over in LA, expectations went through the roof, and without a doubt they were met.  Centered around Shaq, but also getting a lot of production of Kobe, the Lakers won the first of three championships in 2000.  To this day, I can't think of a better NBA moment than in Game 7 of the Western Conference Finals between the Lakers and the Blazers, when Kobe threw up the alley-oop to Shaq to ice a fifteen-point deficit in the fourth quarter.  Though many knew Shaq was the best player on the team, an unstoppable force of size and strength, people like me knew that Kobe's efforts weren't for lost, and that Shaq needed Kobe just as much as Kobe needed Shaq."
            }, {
                "paragraph": "The next year the Lakers dominated, sweeping everyone in the Western Conference and losing only once in the NBA Finals to the Philadelphia 76ers (arguably due to a long layover).  But Kobe proved time and time again that when the Lakers needed a clutch shot in the fourth quarter, that Kobe was the man to do it.  And that continued into 2002, when the Lakers won their third straight Championship, needing every bit of Kobe to get past the Sacramento Kings in the Western Conference Finals.  But despite having the talented duo of Shaq and Kobe, it would not last forever."
            }, {
                "paragraph": "There's no denying Kobe and Shaq were both 'Alpha-Dogs,' capable of leading a team to greatness.  Unfortunately, neither one was willing to back down and wanted to be the 'Sidekick,' which led to the duo not on good terms.  Kobe also faced sexual-assault charges in the summer 2003 from an encounter in Eagle, Colorado.  I was upset having heard the charges, but yet believed the allegations were not true having heard more details.  I don't know what happened that night, but one thing I do know looking back, is that Kobe learned from his mistake and never faced any additional troubles.  By 2004, after the Lakers lost the NBA Finals to Detroit despite adding legends like Karl Malone and Gary Payton, things were about to change for Kobe."
            }, {
                "paragraph": "With Kobe becoming a free agent, and knowing him and Shaq would not ever co-exist together, the Lakers decided to keep Kobe and make him the star of the team, trading Shaq to the Miami Heat.  It was sad to see Shaq go, but being a fan of Kobe, I began disliking Shaq and all the negative comments he would make about Kobe to the public.  Sure, Kobe made his comments behind closed doors, but with Shaq's outgoing personality, it seemed overkill on his part.  It took a few years but I eventually forgave Shaq, but at the time, it was all Kobe for me."
            }, {
                "paragraph": "Without Shaq, Kobe's game was never better.  In fact, when reached his prime, he was an amazing player to watch, hitting impossible shot after impossible shot.  Players like Shane Battier and Bruce Bowen, amongst the best defenders to take on Kobe, would defend him perfectly, but yet Kobe was still capable of draining a jump shot with them in his face.  And how could I forget the infamous 'Kobe Stopper' Ruben Patterson, and how Kobe got him to stop using such a ridiculous nickname after Kobe made some nearly impossible shots against him.  But during his prime, Kobe had to take care of things himself, as the perfectionist and willing to win at all costs Kobe would do.  One particular night, January 29, 2006, stands out for Kobe, as he did the unthinkable and scored 81 points.  The game wasn't on TV, but seeing all the highlights left me in awe.  There were plenty of scoring outbursts for Kobe, including one game against Dallas where he outscored them 62-61 through three quarters in a game, but the 81-point game was special, as only Wilt Chamberlin's famous 100 point game ranks higher."
            }, {
                "paragraph": "By 2007, I reached a crossroads with Kobe, as did he.  He began anew by changing his number from 8 to 24.  It was difficult to get used to at first, but now I see Kobe as both 8 and 24. Tired of losing, Kobe demanded out of LA.  Unable to win consistently and often paired with unreliable players, i.e. Smush Parker, Kobe showed his mean side and began complaining about the Lakers and trying his best to get out, targeting the young and untested Andrew Bynum as trade bait.  It certainly showed Kobe's unlikability, but yet I understood his frustrations.  I openly pondered whether I would root for the Lakers or follow Kobe to Chicago or wherever he wound up.  I had no problem tossing Shaq aside, but Kobe was different.  Thankfully, I never had to make that decision, as midway through the 2008 season, the Lakers got the sidekick Kobe desperately needed, the talented forward of the Memphis Grizzlies, Pau Gasol.  The two would hit if off and push the Lakers to title contenders once again."
            }, {
                "paragraph": "Having Pau Gasol definitely helped Kobe out, and made Kobe a better player and more mature.  Gone were the complaints to the media about being traded, no more criticism of Phil Jackson, whom molded Kobe to be the great player he was.  In a way, it made Kobe more likable to me, because at times Kobe was immature, like any young player.  And through all in all, Kobe fought every step of the way to contribute, sacrificing his health to win now.  Thanks to Pau Gasol and others, the Lakers won NBA titles in 2008 and 2010.  They lost the Finals in 2009 to Boston but got their revenge, beating out their longtime rivals in one of the most hard thought series ever played.  Haters want to criticize Kobe for winning the Finals MVP that year, but that was such a defensive struggle that no one really deserved it, but they had to give it to someone.  Game 7 struggles don't mean anything."
            }, {
                "paragraph": "Things began to change, as the Lakers took a step back and Phil Jackson retired.  Once again, the Lakers shook things up, acquiring Dwight Howard and Steve Nash in separate deals.  Neither of these deals worked out, as Kobe butted heads with Dwight Howard, who couldn't handle Kobe's passion to win and hard work to do so, while Steve Nash couldn't stay healthy.  Even more puzzling was the Lakers decision to hire Mike D'Antoni as head coach, over Phil Jackson, who was interested in coming back a third time.  It was at the end of the 2012 season when Kobe started to show cracks in the armor, when he tore his achilles towards to end of the season.  Unfortunately, Kobe's career was never the same, as he couldn't stay healthy and his body started breaking down."
            }, {
                "paragraph": "Kobe poured his heart and soul for basketball, doing whatever it took to play.  His determination to do whatever it took has caught up with Kobe.  Was he going to take things steady like Tim Duncan, who sacrificed his dominance for a longer career and more championship opportunities?  Heck no.  Did he want to 'just have fun' like Dwight Howard?  Not even remotely possible.  Nor did he try to form a Big Three thinking it was make for easier titles like LeBron?  Try again.  No longer can Kobe hit the shots.  Gone are the days of Kobe dunking with power and athleticism.  It's sad that Kobe will retire, but his body won't get younger anytime soon.  He's played in the NBA for 20 years, racking up numerous awards, honors and titles.  Plenty of people hate him for his personality, his determination, or off-putting attitude, but yet they all know Kobe was one of the greatest in his era.  It's unfortunate it had to end like this, and quite sad how poorly Kobe's playing.  But now's the time to take the farewell tour, bask in the glory and honor a great career.  Thanks for the memories."
            }
        ],
        "image": [{
                "name": "/static/img/kobe2.jpg",
                "caption": "One of the All-Time Greats, and Laker for Life: Kobe Bryant"
            }, {
                "name": "/static/img/kobe3.jpg",
                "caption": "Young Kobe, rockin' the mini-fro, flying high"
            }, {
                "name": "/static/img/kobe5.jpg",
                "caption": "That night Kobe scored 81, he was UNSTOPPABLE!"
            }, {
                "name": "/static/img/kobe4.jpg",
                "caption": "Don't even try to stop him from shooting."
            }
        ]
    },
    "History in the Making: The Lakers on the Wrong Side Edition": {
        "title": "History in the Making: The Lakers on the Wrong Side Edition",
        "date": "November 24, 2015",
        "description": [{
                "paragraph": "Tonight, the Lakers play the Golden State Warriors in a game with the potential of making history.  While the Lakers are used to setting records, tonight it's the Warriors, 15-0, looking for the most consecutive wins the start the season.  Let's be honest, the Lakers have no shot of winning in Golden State.  It's 20-7 as I type this sentence.  But watching the Warriors play, makes me wonder how things have changed drastically in the NBA."
            }, {
                "paragraph": "The Warriors play small ball, not focused on size.  While they deploy Andrew Bogut as their center, it's all about the guards and spread out forwards.  Steph Curry is simply put, the most dynamic offensive player around, maybe ever.  The way Curry shoots, dribbles, and attacks the lane with such smooth efficiency is almost scary to watch.  Klay Thompson, the shooting guard, serves as the perfect complement, able to shoot just as well, but with defensive capabilities as well.  Harrison Barnes is capable of putting up points at any given time.  The key difference to the team is perhaps, Draymond Green, the power forward who can not only pound it and get rebounds, but also shoots three pointers with some efficiency.  And how can you forget last year's Finals MVP Andre Iguadola off the bench as their defensive anchor."
            }, {
                "paragraph": "Seeing the first quarter ending, with the Warriors up 30-11, it's clear the Lakers are nowhere near their talent.  How do the Lakers get there?  As the Lakers showed by selecting D'Angelo Russell over the big man Jahlil Okafor, guard play is taking over the league.  Gone are the days of the big man anchoring a team.  Also apparent is the Warriors excellent drafting.  Curry, Thompson, and Barnes were all lottery picks, and Draymond Green was a pure touch of gold as a second round selection.  The only free agent splash they made was Iguadola, who sacrificed everything by coming off the bench and reaping all the benefits of winning a Championship (and being Finals MVP, nonetheless)."
            }, {
                "paragraph": "The Lakers are working on this.  Russell, Julius Randle and Jordan Clarkson were all draft picks (Clarkson was acquired in the second round last year in a trade for cash), who need time to grow.  Curry, Thompson and Barnes went through their bumps in the beginning.  Now look at them.  Then they can get a star free agent to come along.  Kobe is on his last limbs, and no one will come as a free agent to take over the reigns to play with him.  Why would they?  Gone are the days of players like Shaq coming for the LA glory, when the Lakers were mediocre before his arrival.  Players have more control and want the best chance at an NBA Title, not just sunshine."
            }, {
                "paragraph": "So as I start to get bored watching this game, knowing the Lakers will likely lose by at least 20, if not 30, I offer the Lakers the best advice I can get.  Develop young players: D'Angelo Russell looks better than he did the last time I watched him.  So do Clarkson and Randle.  Make some great draft picks, which can be difficult since the draft is a crap shoot (after all, who knew Kristaps Porzingis would make a good impact for the NY Knicks).  Get high draft picks, since the Lakers need a top three pick to keep it this year (apparently, LSU has a freshman named Ben Simmons who's supposed to be the next big thing, we'll see).  And finally, take your lumps, especially the young players, because it will be a while for the Lakers can become successful again.  So as its 45-28 Warriors, I'll say adieu for tonight, comment on how ridiculously complex the back of their jerseys are (I like the front, quite classy, but the cable car backs seem like overkill, though I would prefer their old school Run-TMC era jerseys) and suggest that my Grandpa and step-Grandma always seem more excited to see Klay Thompson than me (so he used to live down the street, I met him once as a kid, whoopee, but Mychal Thompson was an all-time great at the University of Minnesota, so there's that).  Good night! [Editors Note: The final score was 111-77 Golden State.  They won by 34, go figure]"
            }
        ],
        "image": [{
                "name": "/static/img/warriors.jpg",
                "caption": "One day, the Lakers will stop Steph Curry.  But not today."
            }
        ]
    },
    "Donald Trump: Master Manipulator": {
        "title": "Donald Trump: Master Manipulator",
        "date": "November 23, 2015",
        "description": [{
                "paragraph": "Next year, the United States will elect a new president to lead our country.  We have many candidates to choose from.  Unfortunately, politics, campaigns and spending bring out lots of ugly, negative comments, childish bickering and aiming for the lowest common denominator attempts to attract voters.  Not surprisingly, one candidate stands out in this department, a man obsessed with himself, always trying to gain attention by any means necessary, and a firm believer of 'no news is bad new,'  That man of course, is a man famous for building a rich empire and starring in reality TV shows, Donald Trump."
            }, {
                "paragraph": "Throughout the summer and into the fall, Donald Trump has consistently said outrageous, negative, racist, slanderous and incredibly false statements.  Firing off many ridiculous statements gets the attention he craves, yet many in the media ask all the wrong questions.  At a rally in Birmingham, Alabama, Donald Trump proudly proclaimed that 'he saw thousands of Arab-Americans in Jersey City, New Jersey cheering after 9/11.'  Many pundits, truth-seekers and commentators have taken the opportunity to argue that Donald Trump's statements are bogus and no one has backed up this claim.  Yet they ignore the obvious.  Why does that even matter at all?  Trump knows this will do nothing to help with National Security.  Talking about the past does nothing to help the future."
            }, {
                "paragraph": "The real reason Donald Trump makes comments like this?  To rile up his Anti-Islam voters who want to wage war against all of Islam, of course.  There's no substance in what Trump's saying.  There's no truth in what Trump's saying.  And he knows what he's saying is bullshit.  Trump manipulates his voters by reaching into their hatefulness and gives them a false sense of belief that Trump agrees that Muslims are all 'potential terrorists.'  He spews off 'ideas' that Anti-Islamic voters might like, for example, keeping a database of all Muslims living in the United States, but Trump knows this is unconstitutional, racist and Nazi-inspiring.  Trump is not that stupid, after all, he spent years turning a rich empire to an even more rich empire.  Trump makes these remarks to get attention from his hate-filled voters by getting them to believe that 'Trump cares' or 'Trump can get this done,' despite the fact that Trump can't do much of anything by himself as President of the United States."
            }, {
                "paragraph": "Donald Trump has mastered the art of capturing people's negative emotions at the expense of rational thought.  It's what makes us watch shows like 'Keeping Us With The Kardashians' rather than the news.  As long as Donald Trump says something that captures a person's negative emotions about a group they don't like (e.g. African Americans), they won't care about actual facts if presented to them as false.  Recently, Donald Trump re-tweeted an image claiming that African Americans commit almost all gun-related crimes in the United States, suggesting data from the Crime Statistics Bureau of San Francisco.  This will appeal to racist, uneducated voters, who have no issue citing 'black-on-black' crime but thinks nothing of 'white-on-white' crime.  Yet an educated person would take the time to research this and realize that the Crime Statistics Bureau doesn't exist, and further realize the data doesn't match up at all.  None of this matters to the racist voter, and Donald Trump hooks them in by claiming 'he understands.'"
            }, {
                "paragraph": "Often times, people who are passionate about their political candidate will trust their choice on their issues.  Donald Trump understands this and makes multiple promises that people believe he will achieve.  All politicians promise things they can't achieve, yet Donald Trump takes it a step further by slamming groups of people into the ground while claiming they 'love him' and that he will win their vote.  It's difficult to win the African-American vote when you encourage your voting bloc to 'beat up' Black protesters who protest at your event.  Same with Hispanics, whom Donald Trump has referred to as 'rapists, killers and drug dealers.'  Donald Trump has also made numerous sexist remarks about women yet he claims he'll win the woman vote.  A rational person would question this, as Donald Trump continues to divide voters with negative racist remarks, but gives his voters the impression he's going to win, and has already won."
            }, {
                "paragraph": "Donald Trump has treated his campaign like he would with his TV work.  He acts outrageous to gain his viewers (in the political world, his voters), mocks his enemies (getting the attention from the media he desperately needs to be relevant) and gets enough people talking about him so he can try to convince them he's the right guy to choose.  Manipulating your way to the top might work on 'Survivor,' but this is the real-world, and in the world of politics, at some point, Donald Trump is going to have to offer some credible ideas and make an actual attempt to gain votes from the people he considers 'rapists, killers, drug dealers, terrorists, stupid and unattractive'.  As someone who was a registered Democrat during the entire George W. Bush administration, it is difficult to believe he actually believes a word he says, because in reality, he doesn't.  He simply manipulates people into believing he does, no matter how rational the truth really is and how far apart it differs from Donald Trump's 'vision'.  Truth be told, Donald Trump, who's threatened to leave the Republican Party numerous times to run as an Independent, probably self-identifies as a member of the Donald Trump Party, one he's exclusive to and which he's the only member of.  Because in the end, Donald Trump is a fraud who only cares about one person, himself."
            }
        ],
        "image": [{
                "name": "/static/img/trump.jpg",
                "caption": "Stupid is as Stupid does!"
            }, {
                "name": "/static/img/trump2.jpg",
                "caption": "There's no level this man won't stoop to!"
            }
        ]
    },
    "USC: My Anti-Christ": {
        "title": "USC: My Anti-Christ",
        "date": "November 21, 2015",
        "description": [{
                "paragraph": "Today marks another edition of Oregon vs. USC.  This should be just another game.  But for me, I consider myself the unofficial President of the 'I Hate USC' Club, perhaps just the President of the Portland Chapter of the 'I Hate USC' Club.  It shouldn't have to be this way, but yet I passionately hate USC more than any football program in college sports.  Not schools like Oregon State and Washington, nor schools like Wisconsin, Iowa, and Michigan, rival schools of Oregon (where I started) and Minnesota (where I graduated).  But yet, it's USC that makes me puke the most.  With apologies to my Uncle Fred and cousin Kimmy, two USC graduates who actually show me love and respect (even from afar), here's a time-line of my hatred for USC."
            }, {
                "paragraph": "Growing up, I didn't think much of USC.  Their football team was irrelevant through the 1990's, with the John Robinson and Paul Hackett eras bringing nothing to the table.  Then in 2001, came along a coach no one initially thought would bring anything to the table, Pete Carroll.  After all, a mediocre NFL coach beforehand couldn't possible do much, right?  Wrong.  USC rose to the top under his leadership.  Not surprisingly, when your team does well, its fans become more rabid and arrogant."
            }, {
                "paragraph": "Enter my Uncle Hooter, who started to become quite obsessive with his love for all things USC football.  USC colored everything?  Check!  USC colored game room? Check!  USC fight song doorbell?  The whole thing became sickening.  And throughout this time, my Uncle Hooter always took the opportunity to bash me for going to the University of Oregon.  Never one to show respect, I might have let it slide if not for two things.  First, USC ruled the conference and acted as if they were alone at the top.  It was always 'USC and the Nine Dwarfs.'  Enough to make the remaining members of the conference sick of USC.  Two, I was always reminded of this by Hooter's constant wearing of all things USC colors.  My other Uncle gave me a hard time too because he was an Oregon State grad, but yet he didn't make everything about the Beavers, nor did he always wear Beaver colors."
            }, {
                "paragraph": "The USC impenetrable armor started to crack in 2005, at the 2006 Rose Bowl for the National Championship against Texas.  Have mythically won two straight National Championships, the build-up to the game was ridiculous.  Sports networks like ESPN had already crowned them the National Champion, comparing them to previous title winners over the years.  There was one problem with that though, USC hadn't yet played the game.  Enter Vince Young, the dazzling Texas Quarterback who almost single-handedly beat the USC Trojans and dethroned them.  I guess USC wasn't nearly as good as those all time greats, because they won national championships, USC did not.  Between 2006 and 2009, USC continued to show their arrogance and perceived entitlement, often playing down their opponents.  USC didn't make it back to the National Championship during any of those years, as one Pac-10 team would beat USC in a game USC would have won if they had actually taken them seriously.  This was best exemplified in 2007, when USC, a 42 point favorite against Stanford, lost at the last minute, all the while Stanford, the worst team in the conference at the time, was down to its backup quarterback.  Yet Uncle Hooter would still assume his precious team was the best and downplayed every accomplish every other team had, ignoring the obvious."
            }, {
                "paragraph": "Eventually, USC's dirty little secret came out: Reggie Bush, their electrifying Heisman winner of 2005, broke multiple rules by accepting money from a wannabe agent.  And in typical USC arrogance, the school refused to cooperate with the NCAA once they found out.  Obviously, USC knew of what Bush was doing (how couldn't they?) and wanted it to go away.  It eventually grew to their basketball team.  It took years to come to a ruling, but in 2010 USC became the first team to forfeit a National Championship.  Reggie Bush became the first player ever to forfeit a Heisman Trophy, and multiple sanctions were handed down.  Coincidentally (though most people don't think it was), Pete Carroll went back to the NFL, becoming the coach of the Seattle Seahawks."
            }, {
                "paragraph": "With Pete Carroll out of the picture and heavy sanctions in place, USC fans like my Uncle Hooter became more focused on glorifying the past rather than the present.  Gone were the days of celebrating their recent success of their oldest rival, Notre Dame, which I learned as I bought a Notre Dame shirt and wore it to Rosh Hashanah just to piss him off.  No more days of encouraging his kids to stop trying to beat me at video games, turning off the game because they were losing and celebrating their current success of the time.  It was the only way for Uncle Hooter to stay ahead, as Oregon became the top team in the Conference, not to mention more nationally relevant and popular than USC."
            }, {
                "paragraph": "Their football team was much of the same.  They relied on the past with hopes it would help their present and future.  This was accomplished by hiring Pete Carroll's former assistants to coach the team.  First came Lane Kiffin, who briefly coached the Oakland Raiders, before being fired publicly by then-Owner Al Davis, before coaching the Tennessee Volunteers for one year, racking up more NCAA violations than wins.  Lane Kiffin, a bumbling idiot who considered minor violations a great recruiting tool, had limited scholarships due to their probation and was Bowl-ineligible for his first two seasons.  They got lucky in 2011 to beat Oregon, the top team in the conference.  Sadly, this was one of the biggest highlights of the Hooter's year, as they would criticize Oregon for every loss they got (obviously because they had nothing to be proud of for their team while they were bowl ineligible)."
            }, {
                "paragraph": "Now USC is consistently over-ranked because they are USC.  Never mind their poor coaching, or overrated players who never pan out like they should.  This was true in 2012, when USC began the season ranked #1.  USC finished that year 7-6, free falling to become the worst Preseason #1 ranked team ever.  By the time the Sun Bowl came, USC clearly didn't want any part of the game, losing to Georgia Tech 21-7, a team that needed a waiver just to play in the game.  The most shocking thing was the Lane Kiffin kept his job until midway through the following season.  Their next coach they hired: another former Pete Carroll assistant, Steve Sarkisian, who brought the Washington Huskies out of the ashes of a 6-6 team to the great levels of a 7-5 team.  Though Steve Sarkisian appeared to be an upgrade from Lane Kiffin, hard to believe he was even worse, and lasted even less."
            }, {
                "paragraph": "Sarkisian lasted one full year with USC, finishing as an average 8-5 team losing close games they probably should have won. Despite this, USC was again ranked as the best team in the conference entering this current season.  Not surprisingly USC was over-ranked and looked unimpressive to start the season.  Meanwhile, Steve Sarkisian's life was spiraling out of control, with an alcohol addiction taking control of his life.  Sarkisian was fired midway through the season, after appearing drunk at a meeting.  USC did the right thing by making him go to rehab, but screwed that up by firing him the next day."
            }, {
                "paragraph": "So as I watched Oregon beat the crap out of USC, 48-28, I am reminded how much I truly hate USC.  But as I celebrated my birthday at the Grand Canyon, my Uncle Hooter, whom I don't talk to anymore, couldn't say anything nice to me or acknowledge my birthday.  Instead, all he could do was mock me for my Oregon hat, with the only argument being that Oregon lost the national championship game.  Typical arrogance of a USC fan.  They have nothing to cheer, so they talk down their opponents like Oregon because they have been far more successful as of recent than USC. It's the only reason people like my Uncle Hooter only appreciate the past.  And as I finally gave it to him, reminding him of their cheating, all Uncle Hooter could do was deny it meant anything.  Winning dishonestly is not a good thing, yet USC fans still deny they did anything wrong and believe they were unfairly targeted."
            }, {
                "paragraph": "There's a reason people like me hate USC with a passion.  People like my Uncle Hooter, whom I have no relationship with, always have an inflated ego when it comes to their teams.  They look down at teams like Minnesota (suggesting that any win they get is against subpar opponents).  They believe their team can beat anyone (even though they lost multiple games in a year, that's why Oregon made the National Championship in 2010, they won all their regular season games).  They'll flaunt their legacy (here's looking at you O.J. Simpson, oh wait, his claim to fame was the 'Trial of the Century,' who cares about his football or acting career) and their celebrity fans (Will 'Why does anyone think I'm funny anymore' Ferrell, or Snoop 'My son's a UCLA Bruin' Dogg come to mind).  They love their past, because their present is bad now (I graduated at Minnesota, who has won seven National Championship, but hasn't won a conference title since 1967, doesn't really help now).  There's a reason USC is suddenly setting single game records for most points given up, most yards given up, most touchdown passes given (the latter just set today by Vernon Adams with a 6 touchdown performance).  And it's not because USC is elite."
            }, {
                "paragraph": "So here's my cheers to the USC Trojans and all their obnoxious fans.  Enjoy wishing it was still 2004 USC fans, because the game has gotten faster and USC has gotten slower.  And without the ability to cheat up their sleeves, USC is stuck looking at second place.  There's a reason Steve Sarkisian complained about Oregon jerseys.  There's also a reason of persistent and unrealistic rumors of Chip Kelly taking over the team.  Because the time is now and USC is stuck in reverse."
            }
        ],
        "image": [{
                "name": "/static/img/ducks.jpg",
                "caption": "Vernon Adams: Former USC fan turned USC killer"
            }, {
                "name": "/static/img/deanthony.jpg",
                "caption": "The recruiting tide started to tilt when De'Anthony Thomas went from USC to Oregon."
            }, {
                "name": "/static/img/mariota.jpg",
                "caption": "USC should consider themselves lucky they only had to face Marcus Mariota once."
            }
        ]
    },
    "Don't let Xenophobia ruin your life": {
        "title": "Don't let Xenophobia ruin your life",
        "date": "November 19, 2015",
        "description": [{
                "paragraph": "There are plenty of people who are afraid of people who aren't like them, and it makes me sick to read.  Diversity is one of the greatest things about the United States.  We have lots of ethnicities, religions, identities, etc.  I, for one, am proud to be an American that accepts all races, religions, etc.  We need to embrace others, not fear those who are not like us."
            }, {
                "paragraph": "When I was a young student at West TV, we had a speaker from the United Arab Emirates give a speech.  I don't recall what the speech was about, but what I do remember was that this man wrote my name out in Arabic.  I thought it was the coolest thing.  Obviously a young kid is impressionable, but I didn't see anything wrong with the fact that the man spoke Arabic.  I wish I had kept that slip of paper.  But I kept an open mind, and am better for it."
            }, {
                "paragraph": "On the flip side, we have politicians like Chris Christie suggesting that we shouldn't even let five year olds from Syria into our country as refugees.  It's outrageous to even suggest that a child that young could be a 'potential terrorist.'  People who would stoop to that level are consumed that we should fear the unknown, that somehow, any refugee could be a terrorist, even children.  In that respect, it's much better to view the positive side of things than dwell on negative aspects, and you'll have a much happier life in doing so."
            }, {
                "paragraph": "Naturally, we all have differences that we may take offense to.  No matter who you are, you'll meet someone that has a different view you don't approve.  I met someone in middle school who admitted she had problems accepting Jewish people due to her Muslim faith.  I also met a black woman who admitted not being comfortable around white people.  While I don't necessarily agree with these views, it's not a reason to be prejudiced back at them.  Everyone is entitled to their own beliefs, and it doesn't give one a reason to lump them by race or religion.  I don't take offense against Muslims because some of them aren't Anti-Semitic.  Nor do I hold any hard feelings against people uncomfortable with other races.   As a young person, I did not like to talk about my Jewish faith because I felt like a minority.  I once refused to get a picture with A.C. Green at a camp of his I went to because of he was really Christian and I felt I would be excluded if they knew I was Jewish.  It's not easy being a minority, but it's also not possible to lump people into specific categories based on the actions of the few who set a bad example."
            }, {
                "paragraph": "It's much better to view the world of people as complex and individualistic than in black and white, as many xenophobes do.  Hearing politicians like Ted Cruz argue that we should only allow Christian refugees from Syria into our country implies that Muslims are all terrorists.  They are not.  In fact, ISIS, an organization of Sunni Muslims, has attacked and killed many other Muslims; Shiite, Kurds, you name it.  So obviously a black and white world view doesn't work, because if it was purely religious, Muslims wouldn't be the targets of ISIS.  Furthermore, Ted Cruz believes that being Muslim is somehow the cornerstone of all terrorism, and keeping all of them out is the only way safe.  Again, xenophobes view the world in black and white, yet many terrorist groups in the world are not Muslim at all.  Depending on your definition of terrorism, anyone can be a potential terrorist.  People like Timothy McVeigh and Theodore Kaczynski (a.k.a. the Unabomber) are terrorists for what they did.  Would Ted Cruz call these white people terrorists?  Not likely.  Ted Cruz sees Christians as good, and Muslims as bad.  It doesn't get any plainer than that.  Making such generalizations also makes you more fearful, targeting someone when another person not fitting your profile of a bad guy could be far more dangerous than you realize."
            }, {
                "paragraph": "It goes without saying that anyone is capable of causing harm against you.  It's also true that anyone can be your friend if you get along with them well enough.  You can spend your life open to other cultures, religions and people.  By doing so, you will have a better understanding of how others think, live your life without hysteria and fear of a particular group and generally have less to worry about.  Or, if you are unwilling to get past your xenophobia, you will live your life angry and disgusted, striving for unrealistic goals of so-called purity, targeting groups for no reason other than your perceived negative stereotypes, and misplacing your trust in those who wish to cause you harm but have more in common with you than your perceived enemies.  We can never tell for sure who our friends are, and we definitely can't be sure who our enemies are.  So please, stop living your life in fear and judge them solely by their personality.  That's what determines a person's true value."
            }
        ],
        "image": [{
                "name": "/static/img/peace.jpg",
                "caption": "Peace: Not Hate"
            }
        ]
    },
    "Why Tracy Claeys is the Right Choice for the Golden Gophers": {
        "title": "Why Tracy Claeys is the Right Choice for the Golden Gophers",
        "date": "November 11, 2015",
        "description": [{
                "paragraph": "Two weeks ago, Jerry Kill, the football coach of the Gophers, retired due to health concerns.  It seemed as if Minnesota would plummet to mediocrity yet again.  But despite the loss of Kill, the program made leaps and bounds in terms of success, fan appreciation and continuity while he was there.  Fanfare was much higher than it was when I went there in 2006, with JerrySota becoming a common phrase for Gopher fans.  They had two choices: Keep things the way it was and retain trusty defensive coordinator Tracy Claeys as its coach, or go in a different direction.  Choosing continuity over uncertainty, Minnesota made the right choice to keep Claeys as Head Coach."
            }, {
                "paragraph": "To understand what Jerry Kill meant for the program and how he can continue to affect the program, I'd like to take this time to compare the University of Minnesota, my alma mater, with the University of Oregon, where I spent three years at before transferring.  Much like Minnesota, Oregon has kept virtually the same coaching staff since the legendary Rich Brooks became the coach in 1977.  When he took over, Oregon was just another program.  No tradition, no success, not like it is today.  But he built the program from the ground up, and finally, in 1994, after years of gently scratching the surface, Oregon won its first conference title outright in 100 years and made the Rose Bowl for only the second time in 100 years.  During that time, Rich Brooks kept the same coordinators and assistants around, many of whom are still there today.  It was in this factor that Rich Brooks laid a foundation for years to come.  The same foundation Jerry Kill had in all of his coaching stops.  He didn't stay in one place too long, but yet he kept the same staff everywhere he went, with the same results (winning more than before)."
            }, {
                "paragraph": "The following years after Rich Brooks left Oregon proved to be highly successful.  After the Rose Bowl in 1995, Rich Brooks became a coaching commodity and left for the NFL, where the coached the St. Louis Rams for two seasons.  While he wasn't successful in the NFL, Oregon's success was only beginning.  Did Oregon hire an outside sexy candidate to take over?  Nope, they kept it in the family and made offensive coordinator Mike Bellotti the coach.  And Oregon only got better with Bellotti at the helm.  Though Oregon only won two conference titles in the fourteen years there, he became the winningest coach in history, and led the Ducks to twelve bowl appearances, including a breakthrough 2001 season which Oregon finished ranked #2 in the Nation after a convincing Fiesta Bowl win.  And much like Brooks before him, Bellotti liked to keep his assistants in house and kept virtually the same staff.  Bellotti did reach outside to find a new offensive coordinator in 2007, but instead of finding the big name, he went small and found a relatively unknown offensive coordinator at the University of New Hampshire by the name of Chip Kelly, whose potent offense turned Oregon into a National name.  Two years later, Chip Kelly became the head coach after Bellotti retired."
            }, {
                "paragraph": "Oregon became title contenders with Kelly, reaching BCS bowl games in all four years he was there, played for a National Championship game, and got big time players to join, including Marcus Mariota, who just last year became Oregon's first Heisman Trophy Winner.  And during all this time, Oregon still had coaches left over from Rich Brooks, whose name bears the field at Autzen Stadium.  Later, when Chip Kelly left for the NFL, he turned to his offensive coordinator, Mark Helfrich to be the head coach.  No sexy names, just Oregon Duck lifers, guys who knew the program, worked with the program, and had tradition with the program."
            }, {
                "paragraph": "This is exactly the type of groundwork Minnesota needs.  Jerry Kill preached this type of tradition, loyalty and continuity by keeping the same staff with him for the twenty one years he coached at various schools.  And who better for Minnesota than Tracy Claeys, who filled in for Kill in 2013 when he took a leave of absence to treat his health problems.  Will Claeys be a great coach?  Only time will tell.  But one thing is for sure, Minnesota is on the right track.  Recruits who wanted to play for Jerry Kill were excited that Claeys would take over, knowing that tradition would stay there.    It's much preferred than what Minnesota previously had.  Tim Brewster, a coach with no prior experience, with three different offensive and defensive coordinators in four years, each with a completely different style that didn't fit the players at all.  Glen Mason, who did little to challenge the Gophers, getting bowl eligible due to cupcake non-conference games while routinely getting beat by the big teams.  This is what happens when you don't have any continuity.  The Gophers don't need the home-run hire.  They're not going to get one.  They don't need the hot coach at the moment.  Remember when the Gophers had the rumors with Al Golden, the hot and upcoming coach at Temple?  How did that one work out for Miami, who hired him in 2011 and fired him last month after a 58-0 loss to Clemson?  That's why Tracy Claeys should be the head coach.  The tradition's there, it just needs to grow."
            }
        ],
        "image": [{
                "name": "/static/img/claeys.jpg",
                "caption": "Tracy Claeys on the sidelines"
            }
        ]
    },
    "Confessions of an Online Stalker Part 2": {
        "title": "Confessions of an Online Stalker Part 2",
        "date": "November 9, 2015",
        "description": [{
                "paragraph": "Four years ago, I set out to write an article on Innocent Online Stalking.  The results of the article were quite fascinating.  I met a young woman named Jennifer Bodie and asked her about her online stalking.  She described in length how it affected her and why she did it.  I decided to do a follow up to check in with Jenn and see if she's still doing it."
            }, {
                "paragraph": "Amazingly, Jenn is still stalking people innocently online, still through Facebook.  Jenn friends her own childhood friends on Facebook, not to be real friends with them, but to snoop on their pages and see what they're up to.  Sometimes, Jenn friends, unfriends and friends them again, just because she's bored of not knowing what these people are up to."
            }, {
                "paragraph": "Are you a part of Jenn's past?  Chances are, Jenn has looked you up on Facebook, gone through your friends, and mocked you for who you are.  High school peoples Jenn didn't like, you're not safe from Innocent Online Stalkers like Jenn.  Former co-workers that Jenn didn't like working with?  Don't try to hide, and if you do, watch out.  Jenn's coming for you."
            }, {
                "paragraph": "When we talked to Jenn in 2011, we talked about her online stalking of a certain Alabama chick who wanted to start a Horse Molestation Club.  We asked Jenn if she still stalks her.  The answer is no, as Jenn has bigger fish to prey, she told us.  She even got the idiot ex to 'Like' a sarcastic post complimenting him and friending her on LinkedIn, apparently oblivious to the fact that Jenn can't stand the fool."
            }, {
                "paragraph": "But now Jenn has taken Innocent Online Stalking to a whole new level.  Her latest target, David Brian Michael, a former friend of a relative wanted out of Washington County for check fraud, identity theft and forgery.  In addition to checking his Facebook every day hoping he'll slip up and reveal his location, Jenn is stalking his family members and friends, hoping someone will say something stupid, from Oregon to Louisiana.  No one's safe from Jenn the Innocent Online Stalker.  According to Jenn, it's important to bring this clown to justice.  So remember, if you've seen or heard from David Brian Michael, call the police and send him to prison.  You can make a difference."
            }
        ],
        "image": [{
                "name": "/static/img/jenn.jpg",
                "caption": "Jenn seems Innocent, but she's a stalker"
            }
        ]
    },
    "The 2015-2016 Los Angeles Lakers: One week in the Season": {
        "title": "The 2015-2016 Los Angeles Lakers: One week in the Season",
        "date": "November 5, 2015",
        "description": [{
                "paragraph": "One week into the season, the Lakers are winless (0-4) and have not looked impressive as a whole.  Am I that surprised?  Of course not.  Does the Lakers future look bright?  I'd say yeah, not this year, but a couple years down the road, the Lakers will be contending again."
            }, {
                "paragraph": "Let's start with Kobe Bryant.  His career is almost over, he can't shoot like he used it, and he knows it's a problem.  So unfortunate he's gotten to this point, for all the years of heart and sacrifice he put with the Lakers, and now he's a shell of himself.  But Kobe has an opportunity to develop some young talented players if he can control his shooting tendencies.  Jordan Clarkson looks like a keeper, he's a good shooter and has the heart.  Plus with D'Angelo Russell being drafted, I get the feeling Clarkson has a chip on his shoulder, as he should.  A second-round pick last year who knows by name and order of every point guard taken before him should have plenty of motivation.  As someone who loves that kind of fire, I believe the future is bright for Clarkson.  It's the main reason I wouldn't have taken Russell at the 2nd pick, but we'll see how D'Angelo Russell turns out."
            }, {
                "paragraph": "Speaking of D'Angelo Russell, he's young and raw, so I'll remain patient for a couple of years and hope he turns out well.  He made some nice passes in last night's game against Denver.  But is he going to be the next LeBron?  Of course not.  Kobe wasn't very good his first year, and he was straight outta high school.  Jordan Clarkson spent three years in college, he's battle tested."
            }, {
                "paragraph": "As for the other bright young star for the Lakers, Julius Randle, watch out NBA, Randle has some freakish skills.  In a couple years, when he learns everything, he's going to dominate.  With the bruising style of Zach Randolph mixed with Lamar Odom's finesse, Julius Randle is not your ordinary player.  Watching him take the ball down the court is a sight to see.  He's still young, but perhaps the broken leg in his rookie year will help his game in the long run.  Defensively he needs help but other than that, wow."
            }, {
                "paragraph": "Another week went by, and the Lakers finally got their first victory of the season, against the Brooklyn Nets (who of course are also winless)."
            }
        ],
        "image": [{
                "name": "/static/img/kobe.jpg",
                "caption": "Kobe Bryant upset after a call."
            }
        ]

    },

    "Welcome to Express": {
        "title": "Welcome to Express",
        "date": "October 25, 2015",
        "description": [{
                "paragraph": "Welcome to Bodie Web Design 2.0, the Express Edition.  As you will see on my web page, I have updated my initial version of Bodie Web Design by using Express as a web framework.  So why use Express (or any web framework) instead of just plain HTML, CSS & JavaScript.  The answer is simple: It's easier (if you know how to use it)."
            }, {
                "paragraph": "Gone are the days of using the same code for each page.  Updating the navbar on each page is a thing of the past.  Now I can have a partial template for the navbar and it will update on each page that contains the navbar partial.  No more days of changing one line of code on multiple pages.  If one thing is changed in the template, it affects everything that uses it.  And using it is as easy as include me (me being the partial layout page)."
            }, {
                "paragraph": "HTML, easy to learn, annoying to type.  Every opening tag must have a closing tag.  Wouldn't it be easier to translate something into HTML without opening/closing tags?  Enter the world of Jade.  So what is Jade?  Jade is a HTML template language, which converts jade into HTML.  And now, it's a part of my website.  Now only is it useful for following DRY (Don't Repeat Yourself) principles, but it easy to use.  Because in developing, unlike a good Cappuccino, it's good to be dry."
            }, {
                "paragraph": "But there's way more to Express than just front-end development.  It also handles back-end processes.  Using the powerful Node.js engine to run a website, it uses many of its functions to keep everything going.  Got many pages to add, just set up a new route to go there.  Want to add Jade?  You can set variables and call them out in your code.  For example, instead of typing in Bodie Web Design millions of times, I dried it up and set a variable equal to it, then called for it in my title tags.  Now I can use with, combine with others, and do whatever I want to it.  Yay!"
            }, {
                "paragraph": "But don't take my word for it.  Explore the website for yourself.  Check out my Blog page, conveniently set up with minimum code, repeating through like JSON values parsed through HTML.  Check out my front page, project page, you name it."
            }
        ],
        "image": [{
                "name": "/static/img/ashwaubenon.jpg",
                "caption": "Adam loves Express."
            }
        ]
    }

}